aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_ospi.cpp
//-------------------------------------------------------------------------------------------------
//
//  File : lib_class_STM32H7_ospi.cpp
//
//-------------------------------------------------------------------------------------------------
//
// Copyright(c) 2025 Alain Royer.
// Email: aroyer.qc@gmail.com
//
// Permission is hereby granted, free of charge, to any person obtaining a copy of this software
// and associated documentation files (the "Software"), to deal in the Software without
// restriction, including without limitation the rights to use, copy, modify, merge, publish,
// distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the
// Software is furnished to do so, subject to the following conditions:
//
// The above copyright notice and this permission notice shall be included in all copies or
// substantial portions of the Software.
//
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
// INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
// AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
// DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
//
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
// Include file(s)
//-------------------------------------------------------------------------------------------------

#define OSPI_DRIVER_GLOBAL
#include "./lib_digini.h"
#undef  OSPI_DRIVER_GLOBAL

//-------------------------------------------------------------------------------------------------

#if (USE_OSPI_DRIVER == DEF_ENABLED)

//-------------------------------------------------------------------------------------------------
// Define(s)
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
//
//   Class: OSPI_Driver
//
//
//   Description:   Class to handle OSPI
//
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
// Private Constants and Macros
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
//
//   Constructor:   OSPI_Driver
//
//   Parameter(s):  None
//
//   Description:   Initializes the OSPI peripheral according to the specified Parameters
//
//   Note(s):
//
//                  OSPI_InitStruct: pointer to a OSPI_InitTypeDef structure that contains
//                  the configuration information for the specified OSPI peripheral.
//
//-------------------------------------------------------------------------------------------------
OSPI_Driver::OSPI_Driver()
{
    m_IsItInitialize  = false;
//    m_KickAutoPolling = false;
//    m_IsItBusy        = false;
//    m_State           = OSPI_STATE_RESET;
//    m_ErrorCode       = SYS_READY;
//    m_DMA_ErrorCode   = SYS_READY;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      Initialize
//
//   Parameter(s):  None
//   Return Value:  SystemState_e
//
//   Description:   Initialize the OSPI module
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
SystemState_e OSPI_Driver::Initialize(void)
{
    nOS_Error       Error;
    TickCount_t     TickStart;
    SystemState_e   State = SYS_READY;

    if(m_IsItInitialize == false)
    {
        m_IsItInitialize = true;
        Error = nOS_MutexCreate(&m_Mutex, NOS_MUTEX_RECURSIVE, NOS_MUTEX_PRIO_INHERIT);
        VAR_UNUSED(Error);
    }

  #if (OSPI_SUPPORT_FLASH_RESET_PIN == DEF_ENABLED)
    IO_PinInit(IO_FLASH_RESET);                                     // Init pin reset for Flash at low level (RESET state)
  #endif

    // Enable clock on OSPI module and DMA
    RCC->AHB1ENR |= RCC_AHB1ENR_DMA2EN;
    RCC->AHB3ENR |= RCC_AHB3ENR_OSPIEN;

    // Reset the QuadSPI memory interface
    RCC->AHB3RSTR |=   RCC_AHB3RSTR_OSPIRST;
    RCC->AHB3RSTR &= ~(RCC_AHB3RSTR_OSPIRST);

    return State;                                                                   // Return function status
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      Read
//
//   Parameter(s):  Address     Read start address
//                  pBuffer     Pointer to data to be read
//                  Size        Size of data to read
//   Return Value:  SystemState_e
//
//   Description:   Reads an amount of data from the OSPI memory.
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
SystemState_e OSPI_Driver::Read(uint32_t Address, uint8_t* pBuffer, uint32_t Size)
{
    SystemState_e State = SYS_BUSY;

    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      Write
//
//   Parameter(s):  Address     Write start address
//                  pBuffer     Pointer to data to be written
//                  Size        Size of data to write
//   Return Value:  SystemState_e
//
//   Description:   Write an amount of data to the OSPI memory.
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
SystemState_e OSPI_Driver::Write(uint32_t Address, uint8_t* pBuffer, uint32_t Size)
{
    SystemState_e State = SYS_BUSY;
    
    this->Lock();
    this->Unlock();
    return State;
}

//-------------------------------------------------------------------------------------------------
//
//  ****  ****  * *   *   *  ***** *****
//  *   * *   * * *   *  * *   *   *
//  ****  ****  * *   * *   *  *   ****
//  *     *  *  *  * *  *****  *   *
//  *     *   * *   *   *   *  *   *****
//
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
//
//  Function:       WaitReady
//
//  Parameter(s):   Timeout      Duration of the time out
//  Return Value:
//
//  Description:    Wait for the OSPI module to be ready.
//
//  Note(s):        return  SYS_READY     if available
//                          SYS_TIME_OUT  if busy pass timeout
//
//-------------------------------------------------------------------------------------------------
SystemState_e OSPI_Driver::WaitReady(uint32_t TimeOut)
{
    SystemState_e State = SYS_READY;
    TickCount_t TickStart = GetTick();

    while(((QUADSPI->SR & QUADSPI_SR_BUSY) != 0) && (State == SYS_READY))   // Wait until flag busy is cleared or time out
    {
        nOS_Yield();

        if(TickHasTimeOut(TickStart, TimeOut) == true)
        {
            State = SYS_TIME_OUT;
        }
    }

