aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_ospi.cpp
    while((m_State != OSPI_STATE_READY) && (State == SYS_READY))            // Wait until flag is in expected state
    {
        if(TimeOut != OSPI_MAX_DELAY)                                       // Check for the Timeout
        {
            if(TickHasTimeOut(TickStart, TimeOut) == true)
            {
                State = SYS_TIME_OUT;
            }
        }
    }

    return State;
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       WaitReady
//
//  Parameter(s):   None
//  Return Value:   SYS_READY
//
//  Description:    Wait for the write enable to be ready, stay in if busy.
//
//-------------------------------------------------------------------------------------------------
SystemState_e OSPI_Driver::WriteEnable(void)
{
    SystemState_e State;

    do
    {
        // Enable write operations
        if((State = this->Command(OSPI_CMD_WRITE_ENABLE_QUAD, 0, 0, OSPI_TIMEOUT_DEFAULT_VALUE)) == SYS_READY)
        {
            this->WaitReady(OSPI_TIMEOUT_SHORT_TIMEOUT_VALUE);
        }
    }
    while(State == SYS_BUSY);

    return State;
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       Config
//
//  Parameter(s):   CmdID            The command ID for structure that contains configuration information.
//                  Address          Address to send.
//                  Size             Size of the data
//                  FunctionalMode   Functional mode to configured
//                                      This parameter can be one of the following values:
//                                          OSPI_FUNCTIONAL_MODE_INDIRECT_WRITE:    Indirect write mode
//                                          OSPI_FUNCTIONAL_MODE_AUTO_POLLING:      Automatic polling mode
//  Return Value:   None
//
//  Description:    Configure the communication registers.
//
//-------------------------------------------------------------------------------------------------
void OSPI_Driver::Config(OSPI_CmdList_e CmdID, uint32_t Address, uint32_t Size, uint32_t FunctionalMode)
{
  #if (OSPI_READ_DISCOVERY_PARAMETER == DEF_ENABLED)
    uint8_t DummyCycles;
  #endif

    OSPI_Command_t* pCmd = (OSPI_Command_t*)&m_Cmd[CmdID];

    QUADSPI->FCR = (QUADSPI_FCR_CTEF | QUADSPI_FCR_CTCF);               // Clear interrupt: Transmit error and transmit complete

    if(pCmd->DataMode != OSPI_DATA_NONE)
    {
        QUADSPI->DLR = Size - 1;                                        // Configure OSPI: DLR register with the number of data to read or write
    }

  #if (OSPI_READ_DISCOVERY_PARAMETER == DEF_ENABLED)
    DummyCycles = (CmdID == OSPI_CMD_READ_DISCOVERY_PARAMETER) ? m_DiscoveryDummyCycles : pCmd->DummyCycles;
  #endif

    uint32_t Config = (OSPI_COMMON_CONFIG    |
                       pCmd->DataMode        |
                       pCmd->Instruction     |
                       pCmd->InstructionMode |
                       pCmd->AddressMode     |
                       FunctionalMode        |
                     #if (OSPI_READ_DISCOVERY_PARAMETER == DEF_ENABLED)
                       (DummyCycles << QUADSPI_CCR_DCYC_Pos));
                     #else
                       (pCmd->DummyCycles << QUADSPI_CCR_DCYC_Pos));
                     #endif

    //---- Preset command with common config ----
    if(pCmd->AddressMode != OSPI_ADDRESS_NONE)
    {
        //---- Command with instruction and address ----
        // Configure OSPI: CCR register with all communications parameters
        QUADSPI->CCR = (Config | OSPI_ADDRESS_32_BITS);
        QUADSPI->AR  = Address;                                         // Configure OSPI: AR register with address value
    }
    else
    {
        //---- Command with only instruction ----
        // Configure OSPI: CCR register with all communications parameters
        QUADSPI->CCR = Config;
    }
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       ReadCommand
//
//  Parameter(s):   CmdID        The command ID for structure that contains configuration information.
//                  Address      Address in flash for this command
//                  pData        Pointer on buffer to return data
//                  Size         Size of data to read
//                  Timeout      Timeout duration
//  Return Value:   SystemState_e
//
//  Description:    Read data from specific command.
//
//-------------------------------------------------------------------------------------------------
SystemState_e OSPI_Driver::ReadCommand(OSPI_CmdList_e CmdID, uint32_t Address, uint8_t* pData, uint32_t Size, TickCount_t TimeOut)
{
    SystemState_e State;

    if(pData != nullptr)
    {
        if((State = this->Command(CmdID, Address, Size, TimeOut)) == SYS_READY)
        {
            if((State = this->DMA_Receive(pData, Size)) == SYS_READY)
            {
                // Wait operation to be completed as Status is modified in DMA
                State = this->WaitReady(OSPI_TIMEOUT_READ_COMMAND);
            }
        }
    }
    else
    {
        State = SYS_READY;
    }

    return State;
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       WriteCommand
//
//  Parameter(s):   CmdID        The command ID for structure that contains configuration information.
//                  Address      Address in flash for this command
//                  pData        Pointer on buffer to return data
//                  Size         Size of data to read
//                  Timeout      Timeout duration
//  Return Value:   SystemState_e
//
//  Description:    Write data for specific command.
//
//-------------------------------------------------------------------------------------------------
SystemState_e OSPI_Driver::WriteCommand(OSPI_CmdList_e CmdID, uint32_t Address, uint8_t* pData, uint32_t Size, TickCount_t TimeOut)
{
    SystemState_e State;
    TickCount_t   TickStart;

    if(pData != nullptr)
    {
        TickStart = GetTick();

        if((State = this->Command(CmdID, Address, Size, TimeOut)) == SYS_READY)
        {
            if((State = this->DMA_Transmit(pData, Size)) == SYS_READY)
            {
                while((this->WaitFlashReady() == SYS_BUSY) && (State != SYS_TIME_OUT))
                {
                    nOS_Yield();

                    if(TickHasTimeOut(TickStart, TimeOut) == true)
                    {
                        State = SYS_TIME_OUT;
                    }
                }

                // Wait operation to be completed as Status is modified in DMA
                State = this->WaitReady(OSPI_TIMEOUT_SHORT_TIMEOUT_VALUE);
            }
        }
    }
    else
    {
        State = SYS_ERROR;
    }

