aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_ospi.cpp
    return State;
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       Command
//
//  Parameter(s):   CmdID        The command ID for structure that contains configuration information.
//                  Address      Address in flash for this command
//                  Size         Size of data to read
//                  Timeout      Timeout duration
//  Return Value:   SystemState_e
//
//  Description:    Set the command configuration.
//
//-------------------------------------------------------------------------------------------------
SystemState_e OSPI_Driver::Command(OSPI_CmdList_e CmdID, uint32_t Address, uint32_t Size, TickCount_t Timeout)
{
    SystemState_e State;

    if(m_State == OSPI_STATE_READY)
    {
        m_ErrorCode = SYS_READY;
        m_State     = OSPI_STATE_BUSY;                                          // Update OSPI state
        State = this->WaitFlagStateUntilTimeout(QUADSPI_SR_BUSY, 0, Timeout);   // Wait till BUSY flag reset

        if(State == SYS_READY)
        {
            this->Config(CmdID,
                         Address,
                         Size,
                         OSPI_FUNCTIONAL_MODE_INDIRECT_WRITE);                  // Call the configuration function

            if(m_Cmd[CmdID].DataMode == OSPI_DATA_NONE)
            {
                State = this->WaitFlagStateUntilTimeout(QUADSPI_SR_TCF,
                                                        1,
                                                        OSPI_TIMEOUT_DEFAULT_VALUE);

                if(State == SYS_READY)
                {
                    m_State = OSPI_STATE_READY;                                 // Update OSPI state
                }
            }
            else
            {
                m_State = OSPI_STATE_READY;                                     // Update OSPI state
            }
        }
    }
    else
    {
        State = SYS_BUSY;
    }

    return State;                                                               // Return function status
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       Command_IT
//
//  Parameter(s):   CmdID        The command ID for structure that contains configuration information.
//                  Address      Address in flash for this command
//                  Size         Size of data to read
//  Return Value:   SystemState_e
//
//  Description:    Set the command configuration in interrupt mode.
//
//-------------------------------------------------------------------------------------------------
SystemState_e OSPI_Driver::Command_IT(OSPI_CmdList_e CmdID, uint32_t Address, uint32_t Size)
{
    SystemState_e   State;
    OSPI_DataMode_e DataMode  = m_Cmd[CmdID].DataMode;

    if(m_State == OSPI_STATE_READY)
    {
        m_ErrorCode = SYS_READY;
        m_State     = OSPI_STATE_BUSY;                                          // Update OSPI state
        State = this->WaitFlagStateUntilTimeout(QUADSPI_SR_BUSY,
                                                0,
                                                OSPI_TIMEOUT_DEFAULT_VALUE);    // Wait till BUSY flag reset
        if(State == SYS_READY)
        {
            if(DataMode == OSPI_DATA_NONE)
            {
                SET_BIT(QUADSPI->FCR, (QUADSPI_FCR_CTEF | QUADSPI_FCR_CTCF));   // Clear interrupt: Transmit error and transmit complete
            }

            this->Config(CmdID,
                         Address,
                         Size,
                         OSPI_FUNCTIONAL_MODE_INDIRECT_WRITE);                  // Call the configuration function

            if(DataMode == OSPI_DATA_NONE)
            {
                // When there is no data phase, the transfer start as soon as the configuration is done so activate TC and TE interrupts
                SET_BIT(QUADSPI->CR, QUADSPI_CR_TEIE | QUADSPI_CR_TCIE);        // Enable the OSPI Transfer Error Interrupt
            }
            else
            {
                m_State = OSPI_STATE_READY;                                     // Update OSPI state
            }
        }
    }
    else
    {
        State = SYS_BUSY;
    }

    return State;                                                               // Return function status
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       Abort_IT
//
//  Parameter(s):   None
//  Return Value:   SystemState_e
//
//  Description:    Abort the current transmission (non-blocking function)
//
//-------------------------------------------------------------------------------------------------
SystemState_e OSPI_Driver::Abort_IT(void)
{
    SystemState_e State = SYS_READY;

    if((m_State & OSPI_STATE_BUSY) != 0)                                // Check if the state is in one of the busy states
    {
        m_State = OSPI_STATE_ABORT;                                     // Update OSPI state
        CLEAR_BIT(QUADSPI->CR, (QUADSPI_CR_TOIE |
                                QUADSPI_CR_SMIE |
                                QUADSPI_CR_FTIE |
                                QUADSPI_CR_TCIE |
                                QUADSPI_CR_TEIE));                      // Disable all interrupts

        if(READ_BIT(QUADSPI->CR, QUADSPI_CR_DMAEN) != 0)
        {
            CLEAR_BIT(QUADSPI->CR, QUADSPI_CR_DMAEN);                   // Disable the DMA transfer by clearing the DMAEN bit in the OSPI CR register

            if(this->DMA_Abort() != SYS_READY)
            {
                m_ErrorCode = SYS_ERROR;                                // Set error code to DMA
                State       = SYS_ERROR;
            }
        }
        else
        {
            QUADSPI->FCR = QUADSPI_FCR_CTCF;                            // Clear interrupt
            SET_BIT(QUADSPI->CR, (QUADSPI_CR_TCIE |                     // Enable the OSPI Transfer Complete Interrupt and
                                  QUADSPI_CR_ABORT));                   // Configure OSPI with Abort request
        }
    }
    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      Lock
//
//   Parameter(s):
//   Return Value:
//
//   Description:   Lock the driver
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
void OSPI_Driver::Lock(void)
{
    while(nOS_MutexLock(&m_Mutex, NOS_WAIT_INFINITE) != NOS_OK) {};
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      Unlock
//
//   Parameter(s):
//   Return Value:
//
//   Description:   Unlock the driver
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
void OSPI_Driver::Unlock(void)
{
    nOS_MutexUnlock(&m_Mutex);
}

/**********************************************************************************************************************************
 * @brief           This function handles QUADSPI interrupt request.
 *
 * @param           None
 *
 * @return          None
 *
 *********************************************************************************************************************************/
extern "C" void QUADSPI_IRQHandler(void)
{
    uint32_t Flag      = QUADSPI->SR;
    uint32_t IT_Source = QUADSPI->CR;

