aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_ospi.cpp
    // OSPI Transfer Complete interrupt occurred -------------------------------
    if(((Flag & QUADSPI_SR_TCF) != 0) && ((IT_Source & QUADSPI_CR_TCIE) != 0))
    {
        QUADSPI->FCR = QUADSPI_FCR_CTCF;                            // Clear interrupt
        CLEAR_BIT(QUADSPI->CR, (QUADSPI_CR_TCIE |
                                QUADSPI_CR_TEIE ));                 // Disable the OSPI Transfer Error and Transfer complete Interrupts

        // Transfer complete callback
        if(OSPI.m_State == OSPI_STATE_BUSY_INDIRECT_TX)
        {
            if(READ_BIT(QUADSPI->CR, QUADSPI_CR_DMAEN) != 0)
            {
                CLEAR_BIT(QUADSPI->CR, QUADSPI_CR_DMAEN);           // Disable the DMA transfer by clearing the DMAEN bit in the OSPI CR register
                DMA2_Stream7->CR &= ~DMA_SxCR_EN;                   // Disable the DMA channel
            }

            OSPI.m_State = OSPI_STATE_READY;                        // Change state of OSPI
            OSPI.m_KickAutoPolling = true;                          // When transfer is completed
        }
        else if(OSPI.m_State == OSPI_STATE_BUSY_INDIRECT_RX)
        {
            if(READ_BIT(QUADSPI->CR, QUADSPI_CR_DMAEN) != 0)
            {
                CLEAR_BIT(QUADSPI->CR, QUADSPI_CR_DMAEN);           // Disable the DMA transfer by clearing the DMAEN bit in the OSPI CR register
                DMA2_Stream7->CR &= ~DMA_SxCR_EN;                   // Disable the DMA channel
            }

            OSPI.m_State = OSPI_STATE_READY;                        // Change state of OSPI
        }
        else if(OSPI.m_State == OSPI_STATE_BUSY)
        {
            OSPI.m_State = OSPI_STATE_READY;                        // Change state of OSPI
        }
        else if(OSPI.m_State == OSPI_STATE_ABORT)
        {
            CLEAR_BIT(QUADSPI->CCR, QUADSPI_CCR_FMODE);             // Reset functional mode configuration to indirect write mode by default
            OSPI.m_State = OSPI_STATE_READY;                        // Change state of OSPI

            if(OSPI.m_ErrorCode == SYS_READY)
            {
                // Abort called by the user
                //OSPI.AbortCpltCallback();                           // Abort Complete callback
            }
            else
            {
                // Abort due to an error (eg :  DMA error)
                //OSPI.ErrorCallback();                              // Error callback

            }
        }
    }

    // OSPI Status Match interrupt occurred ------------------------------------
    else if(((Flag & QUADSPI_SR_SMF) != 0) && ((IT_Source & QUADSPI_CR_SMIE) != 0))
    {
        QUADSPI->FCR = QUADSPI_FCR_CSMF;                            // Clear interrupt

        if(READ_BIT(QUADSPI->CR, QUADSPI_CR_APMS) != 0)             // Check if the automatic poll mode stop is activated
        {
            CLEAR_BIT(QUADSPI->CR, (QUADSPI_CR_SMIE |               // Disable Status Match Interrupts
                                    QUADSPI_CR_TEIE));              //    and Transfer Error
            OSPI.m_State = OSPI_STATE_READY;                        // Change state of OSPI
        }
    }

    // OSPI Transfer Error interrupt occurred ---------------------------------
    else if(((Flag & QUADSPI_SR_TEF) != 0) && ((IT_Source & QUADSPI_CR_TEIE) != 0))
    {
        QUADSPI->FCR = QUADSPI_FCR_CTEF;                            // Clear interrupt
        CLEAR_BIT(QUADSPI->CR, (QUADSPI_CR_SMIE |
                                QUADSPI_CR_TCIE |
                                QUADSPI_CR_TEIE |
                                QUADSPI_CR_FTIE));                  // Disable all the OSPI Interrupts
        OSPI.m_ErrorCode = SYS_TRANSFER_ERROR;                      // Set error code

        if(READ_BIT(QUADSPI->CR, QUADSPI_CR_DMAEN) != 0)
        {
            CLEAR_BIT(QUADSPI->CR, QUADSPI_CR_DMAEN);               // Disable the DMA transfer by clearing the DMAEN bit in the OSPI CR register
            //OSPI.XferAbortCallback = OSPI.DMA_AbortCplt;

            if(OSPI.DMA_Abort_IT() != SYS_READY)
            {
                OSPI.m_ErrorCode = SYS_DMA_ERROR;                   // Set error code to DMA
                OSPI.m_State     = OSPI_STATE_READY;                // Change state of OSPI
              //  OSPI.ErrorCallback();                               // Error callback
            }
        }
        else
        {
            OSPI.m_State = OSPI_STATE_READY;                        // Change state of OSPI
            //OSPI.ErrorCallback();                                  // Error callback
        }
    }
}

//-------------------------------------------------------------------------------------------------
//  DDDDDD  MM     MM  AAAAA
//  DD   DD MMMM MMMM AA   AA
//  DD   DD MM MMM MM AAAAAAA
//  DD   DD MM  M  MM AA   AA
//  DDDDDD  MM     MM AA   AA
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
//
//  Function:       DMA_Transmit
//
//  Parameter(s):   pData        Pointer to data buffer.
//                  Size         Size of the DMA TX.
//  Return Value:   SystemState_e
//
//  Description:    Send an amount of data in non-blocking mode with DMA.
//
//-------------------------------------------------------------------------------------------------
SystemState_e OSPI_Driver::DMA_Transmit(uint8_t* pData, uint32_t Size)
{
    SystemState_e State = SYS_READY;

    if(m_State == OSPI_STATE_READY)
    {
        m_ErrorCode = SYS_READY;                        // Clear the error code
        m_State     = OSPI_STATE_BUSY_INDIRECT_TX;      // Update state
        MODIFY_REG(QUADSPI->CCR,
                   QUADSPI_CCR_FMODE,
                   OSPI_FUNCTIONAL_MODE_INDIRECT_WRITE);
        SET_BIT(QUADSPI->CR,
                (QUADSPI_CR_TEIE |                      // Enable the OSPI transfer error
                 QUADSPI_CR_TCIE));                     // Enable TC Interrupts: Workaround for OSPI low kernel clock frequency
        MODIFY_REG(DMA2_Stream7->CR,
                   DMA_SxCR_DIR_Msk,
                   OSPI_DMA_WRITE_DIRECTION);           // DMA Direction : memory to peripheral
        this->DMA_Start(pData, Size + 1);
        SET_BIT(QUADSPI->CR, QUADSPI_CR_DMAEN);
    }
    else
    {
        State = SYS_BUSY;
    }

