aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_ospi.cpp
    return State;
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       DMA_Receive
//
//  Parameter(s):   pData        Pointer to data buffer.
//                  Size         Size to received.
//  Return Value:   SystemState_e
//
//  Description:    Receive an amount of data in non-blocking mode with DMA.
//
//-------------------------------------------------------------------------------------------------
SystemState_e OSPI_Driver::DMA_Receive(uint8_t *pData, uint32_t Size)
{
    SystemState_e State;

    if(m_State == OSPI_STATE_READY)
    {
        m_ErrorCode = SYS_READY;                                            // Clear the error code
        m_State     = OSPI_STATE_BUSY_INDIRECT_RX;                          // Update state

        // Note: OSPI need to be configured to indirect mode before starting the DMA to avoid premature triggering for the DMA transfer
        MODIFY_REG(QUADSPI->CCR,                                            // Configure OSPI: CCR register with functional as indirect read
                   QUADSPI_CCR_FMODE,
                   OSPI_FUNCTIONAL_MODE_INDIRECT_READ);
        MODIFY_REG(DMA2_Stream7->CR,                                        // DMA Direction : peripheral to memory
                   DMA_SxCR_DIR_Msk,
                   OSPI_DMA_READ_DIRECTION);

        if((State = this->DMA_Start(pData, Size + 1)) == SYS_READY)
        {
            SET_BIT(QUADSPI->CR, (QUADSPI_CR_TEIE | QUADSPI_CR_TCIE));      // Enable the OSPI transfer error and transmit complete interrupt
            SET_BIT(QUADSPI->CR, QUADSPI_CR_DMAEN);                         // Enable the OSPI DMA
            QUADSPI->AR = QUADSPI->AR;                                      // Start the transfer by re-writing the address in AR register
        }

        return State;
    }

    return SYS_BUSY;
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       DMA_Start
//
//  Parameter(s):   pData               Data buffer to transfer
//                  BlockDataLength     The length of a block transfer in bytes.
//  Return Value:   SystemState_e
//
//  Description:    Starts the DMA Transfer with interrupts enabled.
//
//-------------------------------------------------------------------------------------------------
SystemState_e OSPI_Driver::DMA_Start(uint8_t* pData, uint32_t BlockDataLength)
{
    m_DMA_ErrorCode = SYS_READY;                                // Initialize the error code
    DMA2_Stream7->NDTR = BlockDataLength;                       // Configure the DMA Channel data length
    DMA2->HIFCR = (DMA_HIFCR_CTEIF7 | DMA_HIFCR_CTCIF7);        // Clear interrupt flags
    DMA2_Stream7->M0AR = (uint32_t)pData;                       // Configure DMA Channel Source address
    DMA2_Stream7->CR |= DMA_SxCR_EN;                            // Enable the Peripheral

    return SYS_READY;
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       DMA_Abort
//
//  Parameter(s):   pData               Data buffer to transfer
//                  BlockDataLength     The length of a block transfer in bytes.
//  Return Value:   SystemState_e
//
//  Description:    Aborts the DMA Transfer.
//
//-------------------------------------------------------------------------------------------------
SystemState_e OSPI_Driver::DMA_Abort(void)
{
    TickCount_t TickStart =  GetTick();

    DMA2_Stream7->CR &= ~(DMA_SxCR_TEIE |                                   // Disable all the transfer interrupts
                          DMA_SxCR_EN);                                     // Disable the channel

    while((DMA2_Stream7->CR & DMA_SxCR_EN) != 0)                            // Check if the DMA Channel is effectively disabled
    {
        if(TickHasTimeOut(TickStart, OSPI_TIMEOUT_DMA_ABORT) == true)
        {
            m_DMA_ErrorCode = SYS_TIME_OUT;                                 // Update error code
            return SYS_ERROR;
        }
    }

    DMA2->HIFCR = DMA_HIFCR_CTEIF7;                                         // Clear all interrupt flags

    return SYS_READY;
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       DMA_Abort_IT
//
//  Parameter(s):   None
//  Return Value:   SystemState_e
//
//  Description:    Aborts the DMA Transfer in Interrupt mode.
//
//-------------------------------------------------------------------------------------------------
SystemState_e OSPI_Driver::DMA_Abort_IT(void)
{
    DMA2_Stream7->CR &= ~DMA_SxCR_EN;             // Disable the DMA channel
    return SYS_READY;
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       DMA2_Stream7_IRQHandler
//
//  Parameter(s):   None
//  Return Value:   None
//
//  Description:    handle the DMA IRQ for OSPI.
//
//-------------------------------------------------------------------------------------------------
extern "C" NOS_ISR(DMA2_Stream7_IRQHandler)
{
    uint32_t Count = 0;
    uint32_t TimeOut = SYSTEM_CORE_CLOCK / 9600U;
    uint32_t Flag;

    Flag = DMA2->HISR;

    // Transfer Error Interrupt management
    if((Flag & DMA_HISR_TEIF7) != 0)
    {
        if((DMA2_Stream7->CR & QUADSPI_CR_TEIE) != 0)
        {
            DMA2_Stream7->CR &= ~QUADSPI_CR_TEIE;               // Disable the transfer error interrupt
            OSPI.m_DMA_ErrorCode = SYS_DMA_ERROR;               // Update error code : Read Transfer error
            DMA2->HIFCR = DMA_HIFCR_CTEIF7;                     // Clear the transfer error flags
        }
    }

    if(OSPI.m_DMA_ErrorCode != SYS_READY)                       // Manage error case
    {
        DMA2_Stream7->CR &= ~DMA_SxCR_EN;                       // Disable the channel

        do
        {
            if(++Count > TimeOut)
            {
                break;
            }
        }
        while((DMA2_Stream7->CR & DMA_SxCR_EN) != 0);

        OSPI.DMA_Error();
    }
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       DMA_Error
//
//  Parameter(s):   None
//  Return Value:   None
//
//  Description:    DMA OSPI communication error callback.
//
//-------------------------------------------------------------------------------------------------
void OSPI_Driver::DMA_Error(void)
{
    m_ErrorCode = SYS_DMA_ERROR;
    CLEAR_BIT(QUADSPI->CR, QUADSPI_CR_DMAEN);       // Disable the DMA transfer by clearing the DMAEN bit in the OSPI CR register
    this->Abort_IT();                               // Abort the OSPI
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       DMA_AbortCplt
//
//  Parameter(s):   None
//  Return Value:   None
//
//  Description:    DMA OSPI abort complete callback.
//
//-------------------------------------------------------------------------------------------------
void OSPI_Driver::DMA_AbortCplt(void)
{
    if(m_State == OSPI_STATE_ABORT)                     // DMA Abort called by OSPI abort
    {
        QUADSPI->FCR = QUADSPI_FCR_CTCF;                // Clear interrupt
        SET_BIT(QUADSPI->CR, QUADSPI_CR_TCEN);          // Enable the OSPI Transfer Complete Interrupt
        SET_BIT(QUADSPI->CR, QUADSPI_CR_ABORT);         // Configure OSPI: CR register with Abort request
    }
    else                                                // DMA Abort called due to a transfer error interrupt
    {
        m_State = OSPI_STATE_READY;                     // Change state of OSPI
        //this->ErrorCallback();                          // Error callback
    }
}

//-------------------------------------------------------------------------------------------------

