aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_ospi.cpp
#endif // (USE_OSPI_DRIVER == DEF_ENABLED)



































#if 0


//-------------------------------------------------------------------------------------------------
//
//   Function:      MemoryMapped
//
//   Parameter(s):  Command    Structure that contains the command configuration information
//                  Config     Structure that contains the memory mapped configuration information.
//   Return Value:  SystemState_e
//
//   Description:   Configure the Memory Mapped mode.
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
SystemState_e OSPI_Driver::MemoryMapped(OSPI_CommandTypeDef* Command, OSPI_MemoryMappedTypeDef* Config)
{
    SystemState_e State;

    State = this->WaitReady(OSPI_FLAG_BUSY, 0, 100);   // TODO found the right timeout

    if(State == SYS_READY)
    {
        // Configure OSPI: CR register with time out counter enable
        QUADSPI->CR &= ~(uint32_t)QuadSPI_CR_TCEN;
        QUADSPI->CR = Config->TimeOutActivation);

        if(Config->TimeOutActivation == OSPI_TIMEOUT_COUNTER_ENABLE)
        {
            // Configure OSPI: LPTR register with the low-power time out value
            QUADSPI->LPTR = Config->TimeOutPeriod;

            // Enable the OSPI TimeOut Interrupt
            QUADSPI->CR |= OSPI_IT_TO;
        }

        // Call the configuration function
        this->Config(Command, OSPI_FUNCTIONAL_MODE_MEMORY_MAPPED);
    }
    else
    {
        State = SYS_BUSY;
    }

    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      Config
//
//   Parameter(s):  Command         Structure that contains the command configuration information
//                  FunctionalMode  Functional mode to configured
//   Return Value:  None
//
//   Description:   This function configures the communication registers
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
void OSPI_Driver::Config(OSPI_CommandTypeDef *Command, uint32_t FunctionalMode)
{
    if((Command->DataMode != OSPI_DATA_NONE) && (FunctionalMode != OSPI_FUNCTIONAL_MODE_MEMORY_MAPPED))
    {
        // Configure OSPI: DLR register with the number of data to read or write
        QUADSPI->DLR, (Command->NbData - 1);
    }

    if(Command->InstructionMode != OSPI_INSTRUCTION_NONE)
    {
        if(Command->AlternateByteMode != OSPI_ALTERNATE_BYTES_NONE)
        {
            // Configure OSPI: ABR register with alternate bytes value
            QUADSPI->ABR, Command->AlternateBytes);

            if(Command->AddressMode != OSPI_ADDRESS_NONE)
            {
                //---- Command with instruction, address and alternate bytes ----
                // Configure OSPI: CCR register with all communications parameters
                QUADSPI->CCR, (Command->DdrMode           | Command->DdrHoldHalfCycle    | Command->SIOOMode           |
                               Command->DataMode          | (Command->DummyCycles << 18) | Command->AlternateBytesSize |
                               Command->AlternateByteMode | Command->AddressSize         | Command->AddressMode        |
                               Command->InstructionMode   | Command->Instruction         | FunctionalMode));

                if(FunctionalMode != OSPI_FUNCTIONAL_MODE_MEMORY_MAPPED)
                {
                    // Configure OSPI: AR register with address value
                    QUADSPI->AR, Command->Address;
                }
            }
            else
            {
                //---- Command with instruction and alternate bytes ----
                // Configure OSPI: CCR register with all communications parameters
                QUADSPI->CCR, (Command->DdrMode           | Command->DdrHoldHalfCycle    | Command->SIOOMode           |
                               Command->DataMode          | (Command->DummyCycles << 18) | Command->AlternateBytesSize |
                               Command->AlternateByteMode | Command->AddressMode         | Command->InstructionMode    |
                               Command->Instruction       | FunctionalMode));
            }
        }
        else
        {
            if(Command->AddressMode != OSPI_ADDRESS_NONE)
            {
                //---- Command with instruction and address ----
                // Configure OSPI: CCR register with all communications parameters
                QUADSPI->CCR, (Command->DdrMode     | Command->DdrHoldHalfCycle    | Command->SIOOMode          |
                               Command->DataMode    | (Command->DummyCycles << 18) | Command->AlternateByteMode |
                               Command->AddressSize | Command->AddressMode         | Command->InstructionMode   |
                               Command->Instruction | FunctionalMode));

                if(FunctionalMode != OSPI_FUNCTIONAL_MODE_MEMORY_MAPPED)
                {
                    // Configure OSPI: AR register with address value
                    QUADSPI->AR, Command->Address;
                }
            }
            else
            {
                //---- Command with only instruction ----
                // Configure OSPI: CCR register with all communications parameters
                QUADSPI->CCR, (Command->DdrMode     | Command->DdrHoldHalfCycle    | Command->SIOOMode          |
                               Command->DataMode    | (Command->DummyCycles << 18) | Command->AlternateByteMode |
                               Command->AddressMode | Command->InstructionMode     | Command->Instruction       |
                               FunctionalMode));
            }
        }
    }
    else
    {
        if(Command->AlternateByteMode != OSPI_ALTERNATE_BYTES_NONE)
        {
            // Configure OSPI: ABR register with alternate bytes value
            QUADSPI->ABR, Command->AlternateBytes;

            if(Command->AddressMode != OSPI_ADDRESS_NONE)
            {
                //---- Command with address and alternate bytes ----
                // Configure OSPI: CCR register with all communications parameters
                QUADSPI->CCR, (Command->DdrMode           | Command->DdrHoldHalfCycle    | Command->SIOOMode           |
                               Command->DataMode          | (Command->DummyCycles << 18) | Command->AlternateBytesSize |
                               Command->AlternateByteMode | Command->AddressSize         | Command->AddressMode        |
                               Command->InstructionMode   | FunctionalMode));

                if(FunctionalMode != OSPI_FUNCTIONAL_MODE_MEMORY_MAPPED)
                {
                    // Configure OSPI: AR register with address value
                    QUADSPI->AR, Command->Address;
                }
            }
            else
            {
                //---- Command with only alternate bytes ----
                // Configure OSPI: CCR register with all communications parameters
                QUADSPI->CCR, (Command->DdrMode           | Command->DdrHoldHalfCycle    | Command->SIOOMode           |
                               Command->DataMode          | (Command->DummyCycles << 18) | Command->AlternateBytesSize |
                               Command->AlternateByteMode | Command->AddressMode         | Command->InstructionMode    |
                               FunctionalMode));
            }
        }
        else
        {
            if(Command->AddressMode != OSPI_ADDRESS_NONE)
            {
                //---- Command with only address ----
                // Configure OSPI: CCR register with all communications parameters
                QUADSPI->CCR, (Command->DdrMode     | Command->DdrHoldHalfCycle    | Command->SIOOMode          |
                               Command->DataMode    | (Command->DummyCycles << 18) | Command->AlternateByteMode |
                               Command->AddressSize | Command->AddressMode         | Command->InstructionMode   |
                               FunctionalMode));

                if(FunctionalMode != OSPI_FUNCTIONAL_MODE_MEMORY_MAPPED)
                {
                    // Configure OSPI: AR register with address value
                    QUADSPI->AR, Command->Address;
                }
            }
            else
            {
                //---- Command with only data phase ----
                if(Command->DataMode != OSPI_DATA_NONE)
                {
                    // Configure OSPI: CCR register with all communications parameters
                    QUADSPI->CCR, (Command->DdrMode     | Command->DdrHoldHalfCycle    | Command->SIOOMode          |
                                   Command->DataMode    | (Command->DummyCycles << 18) | Command->AlternateByteMode |
                                   Command->AddressMode | Command->InstructionMode     | FunctionalMode));
                }
            }
        }
    }
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      Command
//
//   Parameter(s):  Command     Structure that contains the command configuration information
//                  Timeout     Time out duration
//
//   Return Value:  SystemState_e
//
//   Description:   This function is used only in Indirect Read or Write Modes
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
SystemState_e OSPI_Driver::Command(OSPI_CommandTypeDef* Command, uint32_t Timeout)
{
    SystemState_e State;

    // Wait till BUSY flag reset
    State = this->WaitReady(OSPI_FLAG_BUSY, 0, Timeout)

    if(State == SYS_READY)
    {
        // Call the configuration function
        this->Config(Command, OSPI_FUNCTIONAL_MODE_INDIRECT_WRITE);

