aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_ospi.cpp
        if(Command->DataMode == OSPI_DATA_NONE)
        {
            // When there is no data phase, the transfer start as soon as the configuration is done
            // so wait until TC flag is set to go back in idle state
            if(this->WaitReady(OSPI_FLAG_TC, 1, Timeout) != SYS_READY)
            {
                State = SYS_TIME_OUT;
            }
            else
            {
                QUADSPI->FCR = OSPI_FLAG_TC;
            }
        }
    }

  return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      Receive
//
//   Parameter(s):  pData       Pointer to data buffer.
//
//   Return Value:  SystemState_e
//
//   Description:   Receives an amount of data in non blocking mode with DMA.
//
//   Note(s):       This function is used only in Indirect Read Mode
//
//-------------------------------------------------------------------------------------------------
SystemState_e OSPI_Driver::Receive(uint8_t *pData)
{
    SystemState_e State;
    uint32_t *tmp;
    //uint32_t addr_reg = READ_REG(QUADSPI->AR);

    if(pData != nullptr)
    {
        //remove that crap!!
        // Configure counters and size of the handle
        hqspi->RxXferCount = READ_REG(hqspi->Instance->DLR) + 1;
        hqspi->RxXferSize = READ_REG(hqspi->Instance->DLR) + 1;
        hqspi->pRxBuffPtr = pData;
        //hqspi->hdma->XferCpltCallback = OSPI_DMARxCplt;         // Set the OSPI DMA transfer complete callback
        //hqspi->hdma->XferHalfCpltCallback = OSPI_DMARxHalfCplt; // Set the OSPI DMA Half transfer complete callback
        //hqspi->hdma->XferErrorCallback = OSPI_DMAError;         // Set the DMA error callback

        m_pDMA->CR &= ~(uint32_t)DMA_SxCR_DIR;
        m_pDMA->CR |=  DMA_PERIPH_TO_MEMORY;                   // Configure the direction of the DMA

        tmp = (uint32_t*)&pData;        // Enable the DMA Channel
        DMA_Start_IT(hqspi->hdma, (uint32_t)&QUADSPI->DR, *(uint32_t*)tmp, hqspi->RxXferSize);

        QUADSPI->CCR &= ~(uint32_t)QuadSPI_CCR_FMODE;
        QUADSPI->CCR |=  OSPI_FUNCTIONAL_MODE_INDIRECT_READ;    // Configure OSPI: CCR register with functional as indirect read
        // probably it wont work!!
        QUADSPI->AR = QUADSPI->AR;                              // Start the transfer by re-writing the address in AR register
        QUADSPI->CR = QuadSPI_CR_DMAEN;                         // Enable the DMA transfer by setting the DMAEN bit in the OSPI CR register
    }
    else
    {
        State = SYS_ERROR;
    }

    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      Transmit
//
//   Parameter(s):  pData       Pointer to data buffer.
//
//   Return Value:  SystemState_e
//
//   Description:   Sends an amount of data in non blocking mode with DMA.
//
//   Note(s):       This function is used only in Indirect Read Mode
//
//-------------------------------------------------------------------------------------------------
SystemState_e OSPI_Driver::Transmit(uint8_t* pData)
{
  SystemState_e State;
  uint32_t *tmp;

    if(pData != nullptr)
    {
        // Configure counters and size of the handle
        hqspi->TxXferCount = READ_REG(hqspi->Instance->DLR) + 1;
        hqspi->TxXferSize = READ_REG(hqspi->Instance->DLR) + 1;
        hqspi->pTxBuffPtr = pData;

        // Configure OSPI: CCR register with functional mode as indirect write
        QUADSPI->CCR &= ~(uint32_t)QuadSPI_CCR_FMODE;
        QUADSPI->CCR |=  OSPI_FUNCTIONAL_MODE_INDIRECT_WRITE;

        //hqspi->hdma->XferCpltCallback = OSPI_DMATxCplt;           // Set the OSPI DMA transfer complete callback
        //hqspi->hdma->XferHalfCpltCallback = OSPI_DMATxHalfCplt;   // Set the OSPI DMA Half transfer complete callback
        //hqspi->hdma->XferErrorCallback = OSPI_DMAError;           // Set the DMA error callback

        m_pDMA->CR &= ~(uint32_t)DMA_SxCR_DIR;
        m_pDMA->CR |=  DMA_MEMORY_TO_PERIPH;                      // Configure the direction of the DMA

        // Enable the OSPI transmit DMA Channel
        tmp = (uint32_t*)&pData;
        DMA_Start_IT(hqspi->hdma, *(uint32_t*)tmp, (uint32_t)&hqspi->Instance->DR, hqspi->TxXferSize);

        // Enable the DMA transfer by setting the DMAEN bit in the OSPI CR register
        QUADSPI->CR = QuadSPI_CR_DMAEN;
    }
    else
    {
      State = SYS_OK;
    }

    return State;
}

#if 0
//-------------------------------------------------------------------------------------------------
//
//  IRQ Handler:    IRQHandler
//
//  Description:    This function handles SPIx interrupt request.
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
void OSPI_Driver::IRQHandler(void)
{
    if(m_pPort->CallBackISR != nullptr)
    {
        m_pPort->CallBackISR();
    }
}
#endif

#endif // (USE_OSPI_DRIVER == DEF_ENABLED)




#if 0

  GPIO_InitTypeDef GPIO_InitStruct;

  GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStruct.Pull      = GPIO_NOPULL;

  /* Enable the OctoSPI memory interface clock */
  OSPI2_CLK_ENABLE();

  /* Reset the OctoSPI memory interface */
  __HAL_RCC_OSPI2_FORCE_RESET();
  __HAL_RCC_OSPI2_RELEASE_RESET();

  /* Enable the GPIO clocks */
  OSPI2_CS_GPIO_CLK_ENABLE();
  OSPI2_CLK_P_GPIO_CLK_ENABLE();
  OSPI2_D0_GPIO_CLK_ENABLE();
  OSPI2_D1_GPIO_CLK_ENABLE();
  OSPI2_D2_GPIO_CLK_ENABLE();
  OSPI2_D3_GPIO_CLK_ENABLE();
  OSPI2_D4_GPIO_CLK_ENABLE();
  OSPI2_D5_GPIO_CLK_ENABLE();
  OSPI2_D6_GPIO_CLK_ENABLE();
  OSPI2_D7_GPIO_CLK_ENABLE();
  OSPI2_DQS_GPIO_CLK_ENABLE();

  /* OSPI CS GPIO pin configuration  */
  GPIO_InitStruct.Pin       = OSPI2_CS_PIN;
  GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull      = GPIO_PULLUP;
  GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF3_OCTOSPIM_P2;
  HAL_GPIO_Init(OSPI2_CS_GPIO_PORT, &GPIO_InitStruct);

  /* OSPI CLK GPIO pin configuration  */
  GPIO_InitStruct.Pin       = OSPI2_CLK_PIN;
  GPIO_InitStruct.Pull      = GPIO_NOPULL;
  GPIO_InitStruct.Alternate = GPIO_AF9_OCTOSPIM_P2;
  HAL_GPIO_Init(OSPI2_CLK_GPIO_PORT, &GPIO_InitStruct);

  /* OSPI D0 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = OSPI2_D0_PIN;
  GPIO_InitStruct.Alternate = GPIO_AF9_OCTOSPIM_P2;
  HAL_GPIO_Init(OSPI2_D0_GPIO_PORT, &GPIO_InitStruct);

  /* OSPI D1 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = OSPI2_D1_PIN;
  GPIO_InitStruct.Alternate = GPIO_AF9_OCTOSPIM_P2;
  HAL_GPIO_Init(OSPI2_D1_GPIO_PORT, &GPIO_InitStruct);

  /* OSPI2 D2 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = OSPI2_D2_PIN;
  GPIO_InitStruct.Alternate = GPIO_AF9_OCTOSPIM_P2;
  HAL_GPIO_Init(OSPI2_D2_GPIO_PORT, &GPIO_InitStruct);

  /* OSPI2 D3 GPIO pin configuration  */
  GPIO_InitStruct.Pin       = OSPI2_D3_PIN;
  GPIO_InitStruct.Alternate = GPIO_AF9_OCTOSPIM_P2;
  HAL_GPIO_Init(OSPI2_D3_GPIO_PORT, &GPIO_InitStruct);

