aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_ospi.cpp
      if ((reg & OCTOSPIM_PCR_NCSEN) != 0U)
      {
        /* The nCS is enabled on this port */
        if ((reg & OCTOSPIM_PCR_NCSSRC) == (value & OCTOSPIM_PCR_NCSSRC))
        {
          /* The nCS correspond to the instance passed as parameter */
          cfg->NCSPort = index + 1U;
        }
      }

      if ((reg & OCTOSPIM_PCR_IOLEN) != 0U)
      {
        /* The IO Low is enabled on this port */
        if ((reg & OCTOSPIM_PCR_IOLSRC_1) == (value & OCTOSPIM_PCR_IOLSRC_1))
        {
          /* The IO Low correspond to the instance passed as parameter */
          if ((reg & OCTOSPIM_PCR_IOLSRC_0) == 0U)
          {
            cfg->IOLowPort = (OCTOSPIM_PCR_IOLEN | (index + 1U));
          }
          else
          {
            cfg->IOLowPort = (OCTOSPIM_PCR_IOHEN | (index + 1U));
          }
        }
      }

      if ((reg & OCTOSPIM_PCR_IOHEN) != 0U)
      {
        /* The IO High is enabled on this port */
        if ((reg & OCTOSPIM_PCR_IOHSRC_1) == (value & OCTOSPIM_PCR_IOHSRC_1))
        {
          /* The IO High correspond to the instance passed as parameter */
          if ((reg & OCTOSPIM_PCR_IOHSRC_0) == 0U)
          {
            cfg->IOHighPort = (OCTOSPIM_PCR_IOLEN | (index + 1U));
          }
          else
          {
            cfg->IOHighPort = (OCTOSPIM_PCR_IOHEN | (index + 1U));
          }
        }
      }
    }
  }

  /* Return function status */
  return status;
}

#endif /* HAL_OSPI_MODULE_ENABLED */
#endif /* OCTOSPI || OCTOSPI1 || OCTOSPI2 */
#endif // if 0


#if 0 // fron H5 seem almost identical
//-------------------------------------------------------------------------------------------------
//
//  File : lib_class_STM32H5_W25Qxx_xspi.cpp
//
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
// Include file(s)
//-------------------------------------------------------------------------------------------------

#define XSPI_DRIVER_GLOBAL
#include "BSP_board.h"
#undef  XSPI_DRIVER_GLOBAL
#include <string.h>

//-------------------------------------------------------------------------------------------------

using namespace INFRA;

//-------------------------------------------------------------------------------------------------
// Private Define(s)
//-------------------------------------------------------------------------------------------------

//#define DEBUG_TEST_QSPI

#define EXPAND_X_CMD_AS_STRUCT_DATA(CMD_ID,  CMD, CMD_MODE, ADDR_MODE, ADDR_SIZE, DATA_MODE, DUMMY ) \
                                           { CMD, CMD_MODE, ADDR_MODE, ADDR_SIZE, DATA_MODE, DUMMY },

#define MEMORY_READY_MATCH_VALUE    0x00
#define MEMORY_READY_MASK_VALUE     0x01
#define AUTO_POLLING_INTERVAL       0x10

#define XSPI_TIMEOUT_DEFAULT_VALUE  5000

#define QSPI_SR_QUAD_ENABLE_BIT     0x02   

#define MEMORY_DRIVE_MASK           0x60
#define MEMORY_DRIVE_AT_25_PERCENT  0x60
#define MEMORY_DRIVE_AT_50_PERCENT  0x40
#define MEMORY_DRIVE_AT_75_PERCENT  0x20
#define MEMORY_DRIVE_AT_100_PERCENT 0x00

#define XSPI_FUNCTIONAL_MODE_INDIRECT_WRITE ((uint32_t)0x00000000)         // Indirect write mode
#define XSPI_FUNCTIONAL_MODE_INDIRECT_READ  ((uint32_t)XSPI_CR_FMODE_0)    // Indirect read mode
#define XSPI_FUNCTIONAL_MODE_AUTO_POLLING   ((uint32_t)XSPI_CR_FMODE_1)    // Automatic polling mode
#define XSPI_FUNCTIONAL_MODE_MEMORY_MAPPED  ((uint32_t)XSPI_CR_FMODE)      // Memory-mapped mode

//-------------------------------------------------------------------------------------------------
//
//   Class: XSPI_Driver
//
//   Description:   Class to handle XSPI W25Q32 memory
//
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
// Private Constants and Macros
//-------------------------------------------------------------------------------------------------
const W25Q_Command_t W25Q_Driver::m_Cmd[XSPI_NB_OF_CMD] =
{
    XSPI_CMD_DEF(EXPAND_X_CMD_AS_STRUCT_DATA)
};

const DMA_Info_t W25Q_Driver::m_DMA_RX_Info =
{
    BSP_DMA_MODE_NORMAL,
    GPDMA1_REQUEST_OCTOSPI1,
    BSP_DMA_BREQ_SINGLE_BURST,
    BSP_DMA_PERIPHERAL_TO_MEMORY,
    (BSP_DMA_SOURCE_NO_INCREMENT | BSP_DMA_DESTINATION_INCREMENT),
    (BSP_DMA_SOURCE_SIZE_8_BITS  | BSP_DMA_DESTINATION_SIZE_8_BITS),
    BSP_DMA_PRIORITY_LOW_PRIO_WEIGHT_LOW,
    1,
    1,
    BSP_DMA_TC_EVENT_BLOCK_TRANSFER,
    GPDMA1_Channel4,
    DMA_CFCR_TCF,                                   // Transfer complete flag
    GPDMA1_Channel4_IRQn,
    configMAX_SYSCALL_INTERRUPT_PRIORITY,           // PreempPrio
    DMA_LINKED_LIST_DISABLE,
};

const DMA_Info_t W25Q_Driver::m_DMA_TX_Info =
{
    BSP_DMA_MODE_NORMAL,
    GPDMA1_REQUEST_OCTOSPI1,
    BSP_DMA_BREQ_SINGLE_BURST,
    BSP_DMA_MEMORY_TO_PERIPHERAL,
    (BSP_DMA_SOURCE_INCREMENT   | BSP_DMA_DESTINATION_NO_INCREMENT),
    (BSP_DMA_SOURCE_SIZE_8_BITS | BSP_DMA_DESTINATION_SIZE_8_BITS),
    BSP_DMA_PRIORITY_LOW_PRIO_WEIGHT_LOW,
    1,
    1,
    BSP_DMA_TC_EVENT_BLOCK_TRANSFER,
    GPDMA1_Channel5,
    DMA_CFCR_TCF,                                   // Transfer complete flag
    GPDMA1_Channel5_IRQn,
    configMAX_SYSCALL_INTERRUPT_PRIORITY,           // PreempPrio
    DMA_LINKED_LIST_DISABLE,
};

//-------------------------------------------------------------------------------------------------
//
//   Constructor:   W25Q_Driver
//
//   Parameter(s):  None
//
//   Description:   Initializes the SPI peripheral according to the specified parameters
//
//-------------------------------------------------------------------------------------------------
W25Q_Driver::W25Q_Driver() : TFlash()
{
  #ifdef USE_FREERTOS
    m_IsItInitialize  = false;
  #else
    m_IsItDMA_Busy    = false;
  #endif  
    m_Status          = SYS_RESET;
    m_ErrorCode       = SYS_READY;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      Initialize
//
//   Parameter(s):  None
//   Return Value:  SystemState_e
//
//   Description:   Initialize the SPI module
//
//-------------------------------------------------------------------------------------------------
#ifdef DEBUG_TEST_QSPI
uint8_t buffer[256];
uint8_t Buffer1[5000];
uint8_t Buffer2[256];
uint8_t Buffer3[256];
#include <stdio.h>
uint32_t    EraseCounter = 0;
uint32_t    ReadCounter = 0;
uint32_t    WriteErrorCounter = 0;
uint32_t    ReadErrorCounter1 = 0;
uint32_t    ReadErrorCounter2 = 0;
uint32_t    ReadErrorCounter3 = 0;
#endif

