aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_ospi.cpp
SystemState_e W25Q_Driver::Initialize(void)
{
    SystemState_e      State = SYS_READY;
    uint32_t           FlashID;
    uint32_t           Density;

    m_pXSPI = OCTOSPI1;

    XSPI_MSP_Init();              // Initialization of the low level hardware and OCTOSPI

    if(m_Status == SYS_READY)
    {
        m_DMA_TX.Initialize((DMA_Info_t*)&m_DMA_TX_Info);
        m_DMA_TX.SetDestination((void*)&m_pXSPI->DR);          // Configure transmit data register
        m_DMA_RX.Initialize((DMA_Info_t*)&m_DMA_RX_Info);
        m_DMA_RX.SetSource((void*)&m_pXSPI->DR);               // Configure receive data register

      #ifdef USE_FREERTOS
        if(m_IsItInitialize == false)
        {
            m_IsItInitialize = true;
            m_Mutex   = xSemaphoreCreateMutex();                // Create a mutex type semaphore.
            m_DMA_Busy = xSemaphoreCreateBinary();              // Create a binary type semaphore.
        }
      #endif

        if((State = ReadID(&FlashID)) == SYS_READY)
        {
            if((State = ReadSFDP_Density(&Density)) == SYS_READY)
            {
                State = QuadEnable();
            }
        }
    }

    if(State == SYS_READY)
    {
        State = SetDriverStrength(MEMORY_DRIVE_AT_50_PERCENT);
    }

    if(State == SYS_READY)
    {
        m_Status = SYS_READY;

        if(Density > 0)
        {
            m_FlashInfo.PageSize        = 256;
            m_FlashInfo.NbPages         = Density / 256;
            m_FlashInfo.SectorSize      = 1024 * 4;
            m_FlashInfo.SectorEraseSize = 1024 * 4;
            m_FlashInfo.NbSectors       = Density / 4096;
            m_FlashInfo.FlashID         = FlashID;
        }
        else
        {
            // Error... Flash not supported.
            m_FlashInfo.PageSize  = 0;
            m_FlashInfo.NbSectors = 0;
            m_FlashInfo.FlashID   = FlashID;
        }
    }
    else
    {
        m_Status = SYS_INITIALIZATION_FAIL;
    }

#ifdef DEBUG_TEST_QSPI
    memset(Buffer1, 0xFF, 5000);
    memset(Buffer2, 0xFF, 256);
    memset(Buffer3, 0xFF, 256);

    memcpy(Buffer2, "The quick brown fox jumps over the lazy dog. Portez ce vieux whisky au juge blond qui fume. 0123456789", 102);
    //memcpy(Buffer1, "poutine qwertyuiopasdfghjklzxcvbnm,./<>?;':|}{+_)(*&^%$#@!`~ POUTINE", 68);
    memcpy(Buffer3, "0123456789876543210123456789876543210abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ", 89);

/*
	write(Buffer1, 100, 10);
	write(Buffer1, 4000, 5000);
	write(Buffer1, 220, 102);
	write(Buffer2, 1000, 68);
	write(Buffer3, 4080, 89);

    read(buffer, 256,  256);
    read(buffer, 0,    256);
    read(buffer, 220,  256);
    read(buffer, 256,  256);
    read(buffer, 1024,  256);
    read(buffer, 1000,  256);
    read(buffer, 4096,  256);
    read(buffer, 4096 - 256, 256);
    read(buffer, 4096 + 10, 256);
*/

	BulkErase();

    for(uint32_t i = 0; i < m_FlashInfo.NbPages; i++)
    {
        memset(Buffer1, 0xFF, 256);     // Erase buffer
        snprintf((char*)Buffer1, 64, "This is the page number %ld and have fun testing this", i);
        write(Buffer1, i * m_FlashInfo.PageSize, 64);
    }

    write(Buffer2, (5 * m_FlashInfo.PageSize) + 128 , 102);

uint8_t Count = 0;

    while(1)
    {
        Count++;

        if((Count % 10) == 0)
        {
            Count = 0;
            BulkErase();
            EraseCounter++;

            // Check if all page are empty 
            memset(Buffer1, 0xFF, 256);
            for(uint32_t i = 0; i < m_FlashInfo.NbPages; i++)
            {
                read(buffer, i * m_FlashInfo.PageSize, 256);

                if(memcmp(buffer, Buffer1, 64) != 0)
                {
                   ReadErrorCounter1++;
                }
            }

            // Rewrite test content
            for(uint32_t i = 0; i < m_FlashInfo.NbPages; i++)
            {
                memset(Buffer1, 0xFF, 256);     // Erase buffer
                snprintf((char*)Buffer1, 64, "This is the page number %ld and have fun testing this", i);
                write(Buffer1, i * m_FlashInfo.PageSize, 64);
            }

            for(uint32_t i = 0; i < m_FlashInfo.NbPages; i++)
            {
                read(buffer, i * m_FlashInfo.PageSize, 64);

                memset(Buffer1, 0xFF, 256);     // Erase buffer
                snprintf((char*)Buffer1, 64, "This is the page number %ld and have fun testing this", i);
                if(memcmp(buffer, Buffer1, 64) != 0)
                {
                    WriteErrorCounter++;
                }
            }



            write(Buffer2, (5 * m_FlashInfo.PageSize) + 128 , 102);
        }

        for(uint32_t i = 0; i < m_FlashInfo.NbPages; i++)
        {
            read(buffer, i * m_FlashInfo.PageSize, 64);

            memset(Buffer1, 0xFF, 256);     // Erase buffer
            snprintf((char*)Buffer1, 64, "This is the page number %ld and have fun testing this", i);
            if(memcmp(buffer, Buffer1, 64) != 0)
            {
                ReadErrorCounter2++;
            }
        }
    
        read(buffer, (5 * m_FlashInfo.PageSize) + 128, 128);
        if(memcmp(buffer, Buffer2, 128) != 0)
        {
            ReadErrorCounter3++;
        }

        ReadCounter++;

    }
#endif    

    return State;
}

//---------------------------------------------------------------------------------------------
//
//   Function:      XSPI_MSP_Init
//
//   Parameter(s):  None
//   Return Value:  None
//
//   Description:   Low level Init XSPI
//
//---------------------------------------------------------------------------------------------
void W25Q_Driver::XSPI_MSP_Init(void)
{
    RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;

    if(m_Status == SYS_RESET)                                                           // Check if the state is the reset state
    {
        memset(&PeriphClkInitStruct, 0, sizeof(RCC_PeriphCLKInitTypeDef));

        // Initializes the peripherals clock
        PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_OSPI;
        PeriphClkInitStruct.OspiClockSelection   = RCC_OSPICLKSOURCE_HCLK;
        HAL_RCCEx_GetPeriphCLKConfig(&PeriphClkInitStruct);

