aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_ospi.cpp
        RCC->AHB4ENR |= RCC_AHB4ENR_OCTOSPI1EN;                                         // Enable clock on XSPI module

        // Reset the XSPI memory interface
        RCC->AHB4RSTR |=   RCC_AHB4RSTR_OCTOSPI1RST;
        RCC->AHB4RSTR &= ~(RCC_AHB4RSTR_OCTOSPI1RST);

        IO_PinInit(IO_XSPI_CLK);
        IO_PinInit(IO_XSPI_CS);
        IO_PinInit(IO_XSPI_IO0);
        IO_PinInit(IO_XSPI_IO1);
        IO_PinInit(IO_XSPI_IO2);
        IO_PinInit(IO_XSPI_IO3);

        // Configure memory type, device size, chip select high time, free running clock, clock mode
        MODIFY_REG(m_pXSPI->DCR1, (XSPI_DCR1_MTYP  | XSPI_DCR1_DEVSIZE | XSPI_DCR1_CSHT         | XSPI_DCR1_FRCK           | XSPI_DCR1_CKMODE),
                                  (W25_MEMORY_TYPE | W25_MEMORY_SIZE   | W25_CS_HIGH_TIME_CYCLE | W25_FREE_RUN_CLK_DISABLE | W25_CLOCK_MODE_0));

        SET_BIT(m_pXSPI->DCR1, OCTOSPI_DCR1_DLYBYP);                                                                        // Delay block is bypassed
        CLEAR_BIT(m_pXSPI->DCR2, XSPI_DCR2_WRAPSIZE);                                                                       // Configure wrap size not supported (0)
        CLEAR_BIT(m_pXSPI->DCR3, XSPI_DCR3_CSBOUND);                                                                        // Configure chip select boundary to none
        m_pXSPI->DCR4 = 0;                                                                                                  // Configure refresh
        CLEAR_BIT(m_pXSPI->CR, XSPI_CR_FTHRES);                                                                             // Configure FIFO threshold to 1 byte (0)
        m_Status = WaitFlagStateUntilTimeout(HAL_XSPI_FLAG_BUSY, 0, XSPI_TIMEOUT_DEFAULT_VALUE);                            // Wait till busy flag is reset

        if(m_Status == SYS_READY)
        {
            MODIFY_REG(m_pXSPI->DCR2, XSPI_DCR2_PRESCALER, W25_CLOCK_PRESCALER);                                            // Configure clock prescaler
            CLEAR_BIT(m_pXSPI->CR, XSPI_CR_DMM);                                                                            // Configure Memory mode to single memory mode
            MODIFY_REG(m_pXSPI->TCR, (XSPI_TCR_SSHIFT | XSPI_TCR_DHQC), (W25_SAMPLE_SHIFT_NONE | W25_XSPI_DHQC_DISABLE));   // Configure sample shifting and delay hold quarter cycle
            SET_BIT(m_pXSPI->CR, XSPI_CR_EN);                                                                               // Enable XSPI
        }
    
        m_Status = SYS_READY;
    }
}

//---------------------------------------------------------------------------------------------
//
//   Function:      WaitFlagStateUntilTimeout
//
//   Parameter(s):  Flag            Flag to test
//   uint32_t       State           Expected state of the flag,
//                  TimeOut         Timeout duration
//   Return Value:  SystemState_e   State of the function
//
//   Description:   Wait XSPI module to be ready with the requested flag
//
//---------------------------------------------------------------------------------------------
SystemState_e W25Q_Driver::WaitFlagStateUntilTimeout(uint32_t Flag, uint32_t State, uint32_t TimeOut)
{
    uint32_t Tickstart = HAL_GetTick(); 

    while((READ_BIT(m_pXSPI->SR, Flag) == State) ? FALSE : TRUE)        // Wait until flag is in expected state
    {
        if(TimeOut != HAL_MAX_DELAY)                                    // Check for the Timeout
        {
            if(((HAL_GetTick() - Tickstart) > TimeOut) || (TimeOut == 0))
            {
                m_Status = SYS_ERROR;
                return SYS_TIME_OUT;
            }
        }
    }

    return SYS_READY;
}

//---------------------------------------------------------------------------------------------
//
//   Function:      XSPI_Command
//
//   Parameter(s):  pCmd            Struct that contains the command configuration information
//                  Timeout         Timeout duration
//   Return Value:  SystemState_e   State of the function
//
//   Description:   Set the command configuration.
//
//---------------------------------------------------------------------------------------------
SystemState_e W25Q_Driver::XSPI_Command(W25Q_XSPI_RegularCmd_t* const pCmd, uint32_t Timeout)
{
    SystemState_e State;
    
    State = WaitFlagStateUntilTimeout(HAL_XSPI_FLAG_BUSY, 0, Timeout);      // Wait till busy flag is reset

    if(State == SYS_READY)
    {
        m_ErrorCode = SYS_READY;                                            // Initialize error code
        State = ConfigCmd(pCmd);                                            // Configure the registers

        if(State == SYS_READY)
        {
            if(pCmd->DataMode == HAL_XSPI_DATA_NONE)
            {
                // When there is no data phase, the transfer start as soon as the configuration is done so wait until TC flag is set to go back in idle state
                State = WaitFlagStateUntilTimeout(HAL_XSPI_FLAG_TC, HAL_XSPI_FLAG_TC, Timeout);
                m_pXSPI->FCR = HAL_XSPI_FLAG_TC;
            }
        }
    }
    else
    {
        State = SYS_BUSY;
    }

    return State;
}

//---------------------------------------------------------------------------------------------
//
//   Function:      XSPI_Command
//
//   Parameter(s):  pCmd
//   Return Value:  SystemState_e   State of the function
//
//   Description:   Configure the registers for the regular command mode.
//
//   Note(s):       Custom tailored for the W25
//
//---------------------------------------------------------------------------------------------
SystemState_e W25Q_Driver::ConfigCmd(W25Q_XSPI_RegularCmd_t* pCmd)
{
    SystemState_e State = SYS_READY;

    MODIFY_REG(m_pXSPI->CR, XSPI_CR_FMODE | XSPI_CR_MSEL, 0);           // Re-initialize the value of the functional mode in CR
    m_pXSPI->CCR = 0;                                                   // Re-initialize the value with DQS and SIOO modes in CCR
    MODIFY_REG(m_pXSPI->TCR, XSPI_TCR_DCYC, pCmd->DummyCycles);         // Configure the TCR register with the number of dummy cycles

    if(pCmd->DataMode != HAL_XSPI_DATA_NONE)
    {
        m_pXSPI->DLR = (pCmd->DataLength - 1);                          // Configure the DLR register with the number of data
    }

    if(pCmd->InstructionMode != HAL_XSPI_INSTRUCTION_NONE)
    {
        if(pCmd->AddressMode != HAL_XSPI_ADDRESS_NONE)
        {
            if(pCmd->DataMode != HAL_XSPI_DATA_NONE)                    // ---- Command with instruction, address and data ----
            {
                // Configure the CCR register with all communication parameters
                MODIFY_REG(m_pXSPI->CCR, (XSPI_CCR_IMODE | XSPI_CCR_ADMODE | XSPI_CCR_ADSIZE | XSPI_CCR_DMODE),
                                         (pCmd->InstructionMode | pCmd->AddressMode | pCmd->AddressWidth | pCmd->DataMode));
            }
            else                                                        // ---- Command with instruction and address ----
            {
                // Configure the CCR register with all communication parameters
                MODIFY_REG(m_pXSPI->CCR, (XSPI_CCR_IMODE | XSPI_CCR_ADMODE), (pCmd->InstructionMode | pCmd->AddressMode));
            }

            m_pXSPI->IR = pCmd->Instruction;                            // Configure the IR register with the instruction value
            m_pXSPI->AR = pCmd->Address;                                // Configure the AR register with the address value
        }
        else
        {
            if(pCmd->DataMode != HAL_XSPI_DATA_NONE)                    // ---- Command with instruction and data ----
            {

                // Configure the CCR register with all communication parameters
                MODIFY_REG(m_pXSPI->CCR, (XSPI_CCR_IMODE | XSPI_CCR_DMODE),  (pCmd->InstructionMode | pCmd->DataMode));
            }
            else                                                        // ---- Command with only instruction ----
            {
                // Configure the CCR register with all communication parameters
                MODIFY_REG(m_pXSPI->CCR, XSPI_CCR_IMODE, pCmd->InstructionMode);
            }

            m_pXSPI->IR = pCmd->Instruction;                            // Configure the IR register with the instruction value
        }
    }
    else
    {
        if(pCmd->AddressMode != HAL_XSPI_ADDRESS_NONE)
        {
            if(pCmd->DataMode != HAL_XSPI_DATA_NONE)                    // ---- Command with address and data ----
            {
                // Configure the CCR register with all communication parameters
                MODIFY_REG(m_pXSPI->CCR, (XSPI_CCR_ADMODE | XSPI_CCR_DMODE), (pCmd->AddressMode | pCmd->DataMode));
            }
            else                                                        // ---- Command with only address ----
            {
                // Configure the CCR register with all communication parameters
                MODIFY_REG(m_pXSPI->CCR, (XSPI_CCR_ADMODE | XSPI_CCR_ADSIZE), (pCmd->AddressMode | pCmd->AddressWidth));
            }

            m_pXSPI->AR = pCmd->Address;                                // Configure the AR register with the instruction value
        }
        else
        {
            // ---- Invalid command configuration (no instruction, no address) ----
            State       = SYS_ERROR;
            m_ErrorCode = SYS_INVALID_PARAMETER;
        }
    }

