aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_ospi.cpp
    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      write
//
//   Parameter(s):  pBuffer                 Buffer of the data to write
//                  Address                 Address where to write the data
//                  Size                    number of bytes to write
//   Return Value:  bool                    true or false
//
//   Description:   Write data to the flash
//
//-------------------------------------------------------------------------------------------------
bool W25Q_Driver::write(void* pBuffer, uint32_t Address, size_t Size)
{
	SystemState_e  State = SYS_READY;
    uint8_t*       pBuf  = (uint8_t*)pBuffer;
    uint32_t       PageRemainSize;

    PageRemainSize = m_FlashInfo.PageSize - (Address % m_FlashInfo.PageSize);
    
    // Check if the size of the data is less than the remaining place in the page
    if(PageRemainSize > Size)
    {
        PageRemainSize = Size;
    }

    do
    {
        State = WritePage(pBuf, Address, PageRemainSize);

        // Update the address and size variables for next page programming
        Address += PageRemainSize;
        pBuf    += PageRemainSize;
        Size    -= PageRemainSize;
        PageRemainSize = (Size > m_FlashInfo.PageSize) ? m_FlashInfo.PageSize : Size;
    }
    while((Size != 0) && (State == SYS_READY));

	return (State == SYS_READY) ? true : false;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      read
//
//   Parameter(s):  pBuffer                 Buffer of the data to write
//                  Address                 Address where to write the data
//                  Size                    number of bytes to write
//   Return Value:  bool                    true or false
//
//   Description:   Read data from the flash
//
//-------------------------------------------------------------------------------------------------
bool W25Q_Driver::read(void* pBuffer, uint32_t Address, size_t Size)
{
	SystemState_e State = SYS_READY;

	if(Size > 0)
	{
        State = ReadCommand(XSPI_CMD_FAST_READ, Address, (uint8_t*)pBuffer, Size, XSPI_TIMEOUT_DEFAULT_VALUE);
	}

    return (State == SYS_READY) ? true : false;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      WritePage
//
//   Parameter(s):  pBuffer                 Buffer of the data to write
//                  Address                 Address where to write the data
//                  Size                    number of bytes to write
//   Return Value:  SystemState_e           State of the function
//
//   Description:   Write a page data to the flash
//
//-------------------------------------------------------------------------------------------------
SystemState_e W25Q_Driver::WritePage(void* pBuffer, uint32_t Address, size_t Size)
{
    SystemState_e State;

    State = WriteCommand(XSPI_CMD_PAGE_PROG, Address, (uint8_t*)pBuffer, Size, HAL_XSPI_TIMEOUT_DEFAULT_VALUE);

	return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      readID
//
//   Parameter(s):  None
//   Return Value:  uint32_t            ChipID
//
//   Description:   Get the chip ID
//
//-------------------------------------------------------------------------------------------------
uint32_t W25Q_Driver::readID(void)
{
    return m_FlashInfo.FlashID;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      getEraseSectorSize
//
//   Parameter(s):  None
//   Return Value:  uint32_t            Page Size
//
//   Description:   Get the page size
//
//-------------------------------------------------------------------------------------------------
uint32_t W25Q_Driver::getEraseSectorSize(void)
{
    return m_FlashInfo.SectorEraseSize;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      getPageSize
//
//   Parameter(s):  None
//   Return Value:  uint32_t            Page Size
//
//   Description:   Get the page size
//
//-------------------------------------------------------------------------------------------------
uint32_t W25Q_Driver::getPageSize(void)
{
    return m_FlashInfo.PageSize;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      getSectorSize
//
//   Parameter(s):  None
//   Return Value:  uint32_t            Sector Size
//
//   Description:   Get the sector size
//
//-------------------------------------------------------------------------------------------------
uint32_t W25Q_Driver::getSectorSize(void)
{
    return m_FlashInfo.SectorSize;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      eraseSector
//
//   Parameter(s):  SectorAddress       Address of the sector
//   Return Value:  bool                true or false
//
//   Description:   Erase a specific sector
//
//-------------------------------------------------------------------------------------------------
bool W25Q_Driver::eraseSector(uint32_t SectorAddress)
{
    return (EraseSector(SectorAddress, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) == SYS_READY) ? true : false;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      getSizeInBytes
//
//   Parameter(s):  None
//   Return Value:  uint64_t            Flash Size
//
//   Description:   Get the flash size
//
//-------------------------------------------------------------------------------------------------
uint64_t W25Q_Driver::getSizeInBytes(void)
{
    return m_FlashInfo.NbPages * m_FlashInfo.PageSize;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      sync
//
//   Parameter(s):  None
//   Return Value:  None
//
//   Description:   wait for quad flash to be ready
//
//-------------------------------------------------------------------------------------------------
void W25Q_Driver::sync(void)
{
    Lock();       
    WaitReady(HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
    Unlock();
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      BulkErase
//
//   Parameter(s):  None
//   Return Value:  return true or false
//
//   Description:   Erase all the flash content.
//
//-------------------------------------------------------------------------------------------------
bool W25Q_Driver::BulkErase(void)
{
    SystemState_e State;
	
    if((State = WriteEnable()) == SYS_READY)
    {
        State = SendCommand(XSPI_CMD_CHIP_ERASE);
    }

