aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_ospi.cpp
	return (State == SYS_READY) ? true : false;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      EraseSector
//
//   Parameter(s):  SectorAddress       Address of the sector
//                  
//   Return Value:  SystemState_e       SYS_READY of other ERROR
//
//   Description:  Erase a specific sector
//
//-------------------------------------------------------------------------------------------------
SystemState_e W25Q_Driver::EraseSector(uint32_t SectorAddress, TickType_t TimeOut)
{
    SystemState_e State;
	
    State = WriteCommand(XSPI_CMD_SECTOR_ERASE, SectorAddress, nullptr, 0, TimeOut);

	return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      ReadCommand
//
//   Parameter(s):  Command             Command ID to send
//   Return Value:  SystemState_e       State of the function
//
//   Description:   Send a specific command
//
//-------------------------------------------------------------------------------------------------
SystemState_e W25Q_Driver::ReadCommand(W25Q_Command_e Cmd, uint32_t Address, uint8_t* pBuffer, size_t Size, TickType_t TimeOut)
{
    SystemState_e          State = SYS_READY;
    W25Q_XSPI_RegularCmd_t Command;

    PreConfigCommand(&Command, Cmd);
    Command.Address    = Address;
    Command.DataLength = uint32_t(Size);
    Lock();

    if(XSPI_Command(&Command, TimeOut) == SYS_READY)
    {
      #ifndef USE_FREERTOS        
        m_IsItDMA_Busy = true;
      #endif
        State = Receive_DMA(pBuffer);

        if(State == SYS_READY)
        {
            State = WaitForDMA();
        }
    }

    Unlock();
    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      WriteCommand
//
//   Parameter(s):  Command     Command ID to send
//                  Address     Address in flash memory
//                  pBuffer     Data to write
//                  Size        Size of the data
//                  TimeOut     Time out before failing

//   Return Value:  None
//
//   Description:   Send a specific command
//
//-------------------------------------------------------------------------------------------------
SystemState_e W25Q_Driver::WriteCommand(W25Q_Command_e Cmd, uint32_t Address, uint8_t* pBuffer, size_t Size, TickType_t TimeOut, bool IsWR_Enable)
{
    SystemState_e          State = SYS_READY;
    W25Q_XSPI_RegularCmd_t Command;

    if(IsWR_Enable == true)
    {
        State = WriteEnable();
    }

    if(State == SYS_READY)
    {
        PreConfigCommand(&Command, Cmd);
        Command.Address    = Address;
        Command.DataLength = uint32_t(Size);


        if((State = XSPI_Command(&Command, TimeOut)) == SYS_READY)
        {
          #ifndef USE_FREERTOS        
            m_IsItDMA_Busy = true;
          #endif
            State = Transmit_DMA(pBuffer);
        }

        if(State == SYS_READY)
        {
            if((State = WaitForDMA()) == SYS_READY)
            {
                State = WaitReady(HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
            }
        }
    }

    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      ReadID
//
//   Parameter(s):  pChipID                 Pointer on variable to deposit Chip ID
//   Return Value:  SystemState_e
//
//   Description:   Get the Chip ID identification
//
//-------------------------------------------------------------------------------------------------
SystemState_e W25Q_Driver::ReadID(uint32_t* pChipID)
{
    SystemState_e State;
    uint8_t       Buffer[3];

    State = ReadCommand(XSPI_CMD_READ_ID, 0, Buffer, 3, XSPI_TIMEOUT_DEFAULT_VALUE);
	*pChipID = (uint32_t(Buffer[0]) << 16) | (uint32_t(Buffer[1]) << 8) | uint32_t(Buffer[2]);
	
    return State;
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       QuadEnable
//
//  Parameter(s):   None
//  Return Value:   SystemState_e
//
//  Description:    Set the QUAD Enable bit in status register 2.
//
//-------------------------------------------------------------------------------------------------
SystemState_e W25Q_Driver::QuadEnable(void)
{
    SystemState_e State = SYS_READY;
    uint8_t       Status;

    if((State = ReadCommand(XSPI_CMD_READ_STATUS_2, 0, &Status, 1, XSPI_TIMEOUT_DEFAULT_VALUE)) == SYS_READY)
    {
        // Make sure we are not in already enable!
        if((Status & QSPI_SR_QUAD_ENABLE_BIT) == 0)
        {
            Status |= QSPI_SR_QUAD_ENABLE_BIT;
            State = WriteCommand(XSPI_CMD_WRITE_STATUS_2, 0, &Status, 1, XSPI_TIMEOUT_DEFAULT_VALUE, false);

            if(State == SYS_READY)
            {
                Status = 0;

                if((State = ReadCommand(XSPI_CMD_READ_STATUS_2, 0, &Status, 1, XSPI_TIMEOUT_DEFAULT_VALUE)) == SYS_READY)
                {
                    if((Status & QSPI_SR_QUAD_ENABLE_BIT) == 0)
                    {
                        State = SYS_INITIALIZATION_FAIL;
                    }
                }
            }
        }
    }

    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      SetDriverStrength
//
//   Parameter(s):  uint8_t     Strength         Strength value for the output of the IO0 - IO3   
//   Return Value:  
//
//   Description:   This function set the strength of the driver output.
//
//-------------------------------------------------------------------------------------------------
SystemState_e W25Q_Driver::SetDriverStrength(uint8_t Strength)
{
    SystemState_e State = SYS_READY;
    uint8_t       Status;

    if((State = ReadCommand(XSPI_CMD_READ_STATUS_3, 0, &Status, 1, XSPI_TIMEOUT_DEFAULT_VALUE)) == SYS_READY)
    {
        // Make sure we are not already at the right driver setting!
        if((Status & MEMORY_DRIVE_MASK) != Strength)
        {
            Status &= ~uint8_t(MEMORY_DRIVE_MASK);
            Status |= Strength;
            State = WriteCommand(XSPI_CMD_WRITE_STATUS_3, 0, &Status, 1, XSPI_TIMEOUT_DEFAULT_VALUE, true);

            if(State == SYS_READY)
            {
                Status = 0;

                if((State = ReadCommand(XSPI_CMD_READ_STATUS_3, 0, &Status, 1, XSPI_TIMEOUT_DEFAULT_VALUE)) == SYS_READY)
                {
                    if((Status & MEMORY_DRIVE_MASK) != Strength)
                    {
                        State = SYS_INITIALIZATION_FAIL;
                    }
                }
            }
        }
    }

