aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_ospi.cpp
    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      WriteEnable
//
//   Parameter(s):  
//   Return Value:  
//
//   Description:   This function send a Write Enable and wait it is effective.
//
//-------------------------------------------------------------------------------------------------
SystemState_e W25Q_Driver::WriteEnable(void)
{
    return SendCommand(XSPI_CMD_WRITE_ENABLE);                // Enable write operations
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      PreConfigCommand
//
//   Parameter(s):  pCommand        Command structure to fill
//   Command        Command         Command ID to configure
//   Return Value:  None
//
//   Description:   Send a specific command
//
//-------------------------------------------------------------------------------------------------
void W25Q_Driver::PreConfigCommand(W25Q_XSPI_RegularCmd_t* pCommand, W25Q_Command_e Command)
{
    memset(pCommand, 0, sizeof(W25Q_XSPI_RegularCmd_t));

    pCommand->Instruction        = m_Cmd[Command].Instruction;
    pCommand->InstructionMode    = m_Cmd[Command].InstructionMode;
    pCommand->AddressMode        = m_Cmd[Command].AddressMode;
    pCommand->AddressWidth       = m_Cmd[Command].AddressSize;
    pCommand->DataMode           = m_Cmd[Command].DataMode;
    pCommand->DummyCycles        = m_Cmd[Command].DummyCycles;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      SendCommand
//
//   Parameter(s):  Cmd                 Command ID to send
//   Return Value:  SystemState_e
//
//   Description:   Send a specific command
//
//-------------------------------------------------------------------------------------------------
SystemState_e W25Q_Driver::SendCommand(W25Q_Command_e Cmd)
{
    SystemState_e          State;
    W25Q_XSPI_RegularCmd_t Command;

    PreConfigCommand(&Command, Cmd);
    
    if((State = XSPI_Command(&Command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE)) == SYS_READY)
    {
        State = WaitReady(HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
    }

    return State;
}

//-------------------------------------------------------------------------------------------------
//
//  Function:       WaitReady
//
//  Parameter(s):   TimeOut      Duration of the time out
//  Return Value:
//
//  Description:    Wait for the SPI module to be ready.
//
//  Note(s):        return  SYS_READY     if available
//                          SYS_TIME_OUT  if busy pass timeout
//
//-------------------------------------------------------------------------------------------------
SystemState_e W25Q_Driver::WaitReady(TickType_t TimeOut)
{
    W25Q_XSPI_RegularCmd_t  Command;
    SystemState_e           State               = SYS_READY;
//    uint32_t                AddressRegister     = m_pXSPI->AR;
//    uint32_t                InstructionRegister = m_pXSPI->IR;

    PreConfigCommand(&Command, XSPI_CMD_READ_STATUS);
    Command.DataLength = 1;
    
    if(XSPI_Command(&Command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) == SYS_READY)
    {
        State = WaitFlagStateUntilTimeout(HAL_XSPI_FLAG_BUSY, 0, TimeOut);                 // Wait till busy flag is reset

        if(State == SYS_READY)
        {
            // Configure registers
            WRITE_REG(m_pXSPI->PSMAR, MEMORY_READY_MATCH_VALUE);
            WRITE_REG(m_pXSPI->PSMKR, MEMORY_READY_MASK_VALUE);
            WRITE_REG(m_pXSPI->PIR,   AUTO_POLLING_INTERVAL);
            MODIFY_REG(m_pXSPI->CR,   (XSPI_CR_PMM | XSPI_CR_APMS | XSPI_CR_FMODE),
                                      (HAL_XSPI_MATCH_MODE_AND | HAL_XSPI_AUTOMATIC_STOP_ENABLE | XSPI_FUNCTIONAL_MODE_AUTO_POLLING));

            if(READ_BIT(m_pXSPI->CCR, XSPI_CCR_ADMODE) != HAL_XSPI_ADDRESS_NONE)                // Trig the transfer by re-writing address or instruction register
            {
                WRITE_REG(m_pXSPI->AR, Command.Address); //AddressRegister);
            }
            else
            {
                WRITE_REG(m_pXSPI->IR, Command.Instruction);//InstructionRegister);
            }

            State = WaitFlagStateUntilTimeout(HAL_XSPI_FLAG_SM, HAL_XSPI_FLAG_SM, TimeOut);     // Wait till status match flag is set to go back in idle state

            if(State == SYS_READY)
            {
                WRITE_REG(m_pXSPI->FCR, HAL_XSPI_FLAG_SM);                                      // Clear status match flag
                m_Status = SYS_READY;
            }
        }
    }

    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      Lock
//
//   Parameter(s):  None
//   Return Value:  None
//
//   Description:   Lock the driver
//
//-------------------------------------------------------------------------------------------------
void W25Q_Driver::Lock(void)
{
  #ifdef USE_FREERTOS
    taskENTER_CRITICAL();
    xSemaphoreTake(m_Mutex, portMAX_DELAY);
  #endif
    m_Status = SYS_LOCK;
  #ifdef USE_FREERTOS
    taskEXIT_CRITICAL();
  #endif    
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      Unlock
//
//   Parameter(s):  None
//   Return Value:  None
//
//   Description:   Unlock the driver
//
//-------------------------------------------------------------------------------------------------
void W25Q_Driver::Unlock(void)
{
  #ifdef USE_FREERTOS
    taskENTER_CRITICAL();
    xSemaphoreGive(m_Mutex);
  #endif 
    m_Status = SYS_UNLOCK;
  #ifdef USE_FREERTOS
    taskEXIT_CRITICAL();
  #endif    
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      ReadSFDP_Density
//
//   Parameter(s):  uint32_t*       pDensity            Pointer to return density value
//   Return Value:  SystemState_e
//
//   Description:   Get density value of the flash
//
//-------------------------------------------------------------------------------------------------
SystemState_e W25Q_Driver::ReadSFDP_Density(uint32_t* pDensity)
{
    SystemState_e State = SYS_READY;
    
