aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_ospi.cpp
    *pDensity = 0;

    // Check JEDEC serial flash discoverable parameters for device specific info
    uint8_t Header[16];

    if((State = ReadCommand(XSPI_CMD_READ_DISCOVERY_PARAMETER, 0, Header, 16, XSPI_TIMEOUT_DEFAULT_VALUE)) == SYS_READY)
    {
        // Verify SFDP signature for sanity, and check that major/minor version is acceptable
        if((memcmp(&Header[0], "SFDP", 4) != 0) || (Header[5] != 1))
        {
            return State;
        }

        // The SFDP spec indicates the standard table is always at offset 0
        // in the parameter headers, we check just to be safe
        if((Header[8] != 0) || (Header[10] != 1))
        {
            return State;
        }

        // Parameter table pointer, spi commands are BE, SFDP is LE,
        // also sfdp command expects extra read wait byte
        uint8_t Table[8];
        uint32_t TableAddress = (Header[14] << 16) | (Header[13] << 8) | Header[12];
        
        if((State = ReadCommand(XSPI_CMD_READ_DISCOVERY_PARAMETER, TableAddress, Table, 8, XSPI_TIMEOUT_DEFAULT_VALUE)) == SYS_READY)
        {
            // Check erase size, currently only supports 4 kbytes
            if(((Table[0] & 0x3) != 0x1) || (Table[1] != 0x20)) // 4K erase sector
            {
                return State;
            }

            // Check address size, currently only supports 3 bytes addresses
            if(((Table[2] & 0x4) != 0) || ((Table[7] & 0x80) != 0))
            {
                return State;
            }

            // Get device density, stored as size in bits - 1
            *pDensity = ((Table[7] << 24) |  (Table[6] << 16) | (Table[5] << 8 ) | (Table[4] << 0 ));
            *pDensity = (*pDensity + 1) / 8;
        }
    }

    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      Transmit_DMA
//
//   Parameter(s):  uint8_t* pData          Pointer to data buffer
//   Return Value:  SystemState_e
//
//   Description:   Send an amount of data in non-blocking mode with DMA.
//
//-------------------------------------------------------------------------------------------------
SystemState_e W25Q_Driver::Transmit_DMA(uint8_t* pData)
{
    SystemState_e  State     = SYS_READY;
    uint32_t       DataSize  = m_pXSPI->DLR + 1;

    #ifndef USE_FREERTOS        
    m_IsItDMA_Busy = true;
    #endif  

    MODIFY_REG(m_pXSPI->CR, XSPI_CR_FMODE, XSPI_FUNCTIONAL_MODE_INDIRECT_WRITE);	            // Configure CR register with functional mode as indirect write
    WRITE_REG(m_pXSPI->FCR, HAL_XSPI_FLAG_TE | HAL_XSPI_FLAG_TC); 				                // Clear flags related to interrupt
    m_DMA_TX.EnableInterrupt(DMA_IT_TC | DMA_IT_DTE | DMA_IT_ULE | DMA_IT_USE | DMA_IT_TO);
    m_DMA_TX.SetSource(pData);                                                                  // Set DMA source
    m_DMA_TX.SetLength(DataSize);                                                               // Set size of the TX
    m_DMA_TX.WriteTransferRegisters();
    m_Status = SYS_BUSY_TX;                                                                     // Update the state
    m_DMA_TX.Enable();                                                                          // Enable the DMA module
    m_DMA_TX.ClearFlag();                                                                       // Clear IRQ DMA flag
    SET_BIT(m_pXSPI->CR, XSPI_CR_DMAEN);                                                        // Enable the DMA transfer by setting the DMAEN bit

    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      Receive_DMA
//
//   Parameter(s):  uint8_t* pData          Pointer to data buffer
//   Return Value:  SystemState_e
//
//   Description:   Receive an amount of data in non-blocking mode with DMA.
//
//-------------------------------------------------------------------------------------------------
SystemState_e W25Q_Driver::Receive_DMA(uint8_t* pData)
{
    SystemState_e  State         = SYS_READY;
    uint32_t       DataSize      = m_pXSPI->DLR + 1;
	uint32_t AddressRegister     = m_pXSPI->AR;
	uint32_t InstructionRegister = m_pXSPI->IR;

    #ifndef USE_FREERTOS        
    m_IsItDMA_Busy = true;
    #endif  

    MODIFY_REG(m_pXSPI->CR, XSPI_CR_FMODE, XSPI_FUNCTIONAL_MODE_INDIRECT_READ);	                // Configure CR register with functional mode as indirect read
    WRITE_REG(m_pXSPI->FCR, HAL_XSPI_FLAG_TE | HAL_XSPI_FLAG_TC); 				                // Clear flags related to interrupt
    m_DMA_RX.EnableInterrupt(DMA_IT_TC | DMA_IT_DTE | DMA_IT_ULE | DMA_IT_USE | DMA_IT_TO);
    m_DMA_RX.SetDestination(pData);                                                             // Set DMA source
    m_DMA_RX.SetLength(DataSize);                                                               // Set size of the RX
    m_DMA_RX.WriteTransferRegisters();
    m_Status = SYS_BUSY_RX;                                                                     // Update the state
    m_DMA_RX.Enable();                                                                          // Enable the DMA module
    m_DMA_RX.ClearFlag();                                                                       // Clear IRQ DMA flag

    if(READ_BIT(m_pXSPI->CCR, XSPI_CCR_ADMODE) != HAL_XSPI_ADDRESS_NONE)
    {
        WRITE_REG(m_pXSPI->AR, AddressRegister);
    }
    else
    {
        WRITE_REG(m_pXSPI->IR, InstructionRegister);
    }

    SET_BIT(m_pXSPI->CR, XSPI_CR_DMAEN);              // Enable the DMA transfer by setting the DMAEN bit

    return State;
}

//-------------------------------------------------------------------------------------------------
//
//   Function:      DMA_RX_IRQ_Handler and DMA_TX_IRQ_Handler
//
//   Parameter(s):  None
//   Return Value:  None
//
//   Description:   DMA IRQ handler for XSPI
//
//-------------------------------------------------------------------------------------------------
void W25Q_Driver::DMA_RX_IRQ_Handler(void)
{
	m_pXSPI->FCR = HAL_XSPI_FLAG_TC;
    m_Status = SYS_READY;
    CLEAR_BIT(m_pXSPI->CR, XSPI_CR_DMAEN);    // Disable the DMA transfer on the XSPI side
    m_DMA_RX.Disable();
    m_DMA_RX.ClearFlag();                               // Clear TC and HT transfer flags
    ReleaseFromISR();
}

