aroyer-qc/Digini/Peripheral/src/port/STM32H7xx/lib_class_STM32H7_ospi.cpp
void W25Q_Driver::DMA_TX_IRQ_Handler(void)
{
	m_pXSPI->FCR = HAL_XSPI_FLAG_TC;
    m_Status = SYS_READY;
    CLEAR_BIT(m_pXSPI->CR, XSPI_CR_DMAEN);    // Disable the DMA transfer on the XSPI side
    m_DMA_TX.Disable();
    m_DMA_TX.ClearFlag();                               // Clear TC and HT transfer flags
    ReleaseFromISR();
}

//-------------------------------------------------------------------------------------------------
//
//  Name:           ReleaseFromISR
//
//  Parameter(s):   None
//  Return:         void
//
//  Description:    Common code for DMA RX and TX
//
//-------------------------------------------------------------------------------------------------
void W25Q_Driver::ReleaseFromISR(void)
{
  #ifdef USE_FREERTOS
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xSemaphoreGiveFromISR(m_DMA_Busy, &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
  #else
    m_IsItDMA_Busy = false;
  #endif
}

//-------------------------------------------------------------------------------------------------
//
//  Name:           WaitForDMA
//
//  Parameter(s):   None
//  Return:         SystemState_e               SYS_READY or SYS_TIMEOUT
//
//  Description:    Wait for DMA to release flag or FreeRTOS semaphore.
//
//-------------------------------------------------------------------------------------------------
SystemState_e W25Q_Driver::WaitForDMA(void)
{
    SystemState_e State;
  #ifndef USE_FREERTOS
    uint32_t    TickStart  = GetTick();
    uint32_t    ElapseTick;
  #endif

  #ifdef USE_FREERTOS
    State = (xSemaphoreTake(m_DMA_Busy, XSPI_TIMEOUT_DEFAULT_VALUE) == pdFALSE) ? SYS_TIME_OUT : SYS_READY;
  #else
    // Don't do a busy wait if
    //           1) We're in FreeRTOS context
    //           2) and not in an interrupt
    //           3) and the semaphore raised within 100ms
    do
    {
        State = TickHasTimeOut(TickStart, XSPI_TIMEOUT_DEFAULT_VALUE) ? SYS_TIME_OUT : SYS_READY;
    }
    while((m_IsItDMA_Busy == true) && (State == SYS_READY));

    #endif

    return State;
}

//-------------------------------------------------------------------------------------------------

extern "C"
{
    //---------------------------------------------------------------------------------------------
    //
    //   Function:      GPDMA1_Channel4_IRQHandler
    //
    //   Parameter(s):  None
    //   Return Value:  None
    //
    //   Description:   This function handles GPDMA1 Channel 4 global interrupt for OCTOSPI.
    //
    //---------------------------------------------------------------------------------------------
    void GPDMA1_Channel4_IRQHandler(void)
    {
        W25Q32.DMA_RX_IRQ_Handler();
    }

    //---------------------------------------------------------------------------------------------
    //
    //   Function:      GPDMA1_Channel5_IRQHandler
    //
    //   Parameter(s):  None
    //   Return Value:  None
    //
    //   Description:   This function handles GPDMA1 Channel 5 global interrupt for OCTOSPI
    //
    //---------------------------------------------------------------------------------------------
    void GPDMA1_Channel5_IRQHandler(void)
    {
        W25Q32.DMA_TX_IRQ_Handler();
    }

    //---------------------------------------------------------------------------------------------
}

//-------------------------------------------------------------------------------------------------


#endif




#if 0 


  OSPI_HyperbusCfgTypeDef sHyperbusCfg;
  OSPI_HyperbusCmdTypeDef sCommand;
  OSPI_MemoryMappedTypeDef sMemMappedCfg;

  uint32_t address = 0;
  uint16_t index;
  __IO uint32_t *mem_addr;

  /* Initialize OctoSPI ----------------------------------------------------- */
  OSPIHandle.Instance = OCTOSPI2;
  HAL_OSPI_DeInit(&OSPIHandle);

  OSPIHandle.Init.FifoThreshold         = 4;
  OSPIHandle.Init.DualQuad              = HAL_OSPI_DUALQUAD_DISABLE;
  OSPIHandle.Init.MemoryType            = HAL_OSPI_MEMTYPE_HYPERBUS;
  OSPIHandle.Init.DeviceSize            = OSPI_HYPERRAM_SIZE;
  OSPIHandle.Init.ChipSelectHighTime    = 8;
  OSPIHandle.Init.FreeRunningClock      = HAL_OSPI_FREERUNCLK_DISABLE;
  OSPIHandle.Init.ClockMode             = HAL_OSPI_CLOCK_MODE_0;
  OSPIHandle.Init.WrapSize              = HAL_OSPI_WRAP_NOT_SUPPORTED;
  OSPIHandle.Init.ClockPrescaler        = 4;
  OSPIHandle.Init.SampleShifting        = HAL_OSPI_SAMPLE_SHIFTING_NONE;
  OSPIHandle.Init.DelayHoldQuarterCycle = HAL_OSPI_DHQC_ENABLE;
  OSPIHandle.Init.DelayBlockBypass      = HAL_OSPI_DELAY_BLOCK_USED;
  OSPIHandle.Init.ChipSelectBoundary    = 23;
  OSPIHandle.Init.Refresh               = 250; /* The chip select should be released every 4�s */

  if (HAL_OSPI_Init(&OSPIHandle) != HAL_OK)
  {
    Error_Handler() ;
  }

  /* Configure the Hyperbus to access memory space -------------------------- */
  sHyperbusCfg.RWRecoveryTime   = OSPI_HYPERRAM_RW_REC_TIME;
  sHyperbusCfg.AccessTime       = OSPI_HYPERRAM_LATENCY;
  sHyperbusCfg.WriteZeroLatency = HAL_OSPI_LATENCY_ON_WRITE;
  sHyperbusCfg.LatencyMode      = HAL_OSPI_FIXED_LATENCY;

  if (HAL_OSPI_HyperbusCfg(&OSPIHandle, &sHyperbusCfg, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    Error_Handler();
  }

  /* Memory-mapped mode configuration --------------------------------------- */
  sCommand.AddressSpace = HAL_OSPI_MEMORY_ADDRESS_SPACE;
  sCommand.AddressSize  = HAL_OSPI_ADDRESS_32_BITS;
  sCommand.DQSMode      = HAL_OSPI_DQS_ENABLE;
  sCommand.Address      = 0;
  sCommand.NbData       = 1;

  if (HAL_OSPI_HyperbusCmd(&OSPIHandle, &sCommand, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    Error_Handler();
  }

  sMemMappedCfg.TimeOutActivation = HAL_OSPI_TIMEOUT_COUNTER_DISABLE;

  if (HAL_OSPI_MemoryMapped(&OSPIHandle, &sMemMappedCfg) != HAL_OK)
  {
    Error_Handler();
  }

  /* Enable and set OctoSPI interrupt to the lowest priority */
  HAL_NVIC_SetPriority(OCTOSPI2_IRQn, 0x0F, 0);
  HAL_NVIC_EnableIRQ(OCTOSPI2_IRQn);


/**
  * @brief  Rx Transfer completed callbacks.
  * @param  hospi: OSPI handle
  * @retval None
  */
void HAL_OSPI_RxCpltCallback(OSPI_HandleTypeDef *hospi)
{
  RxCplt++;
}

/**
  * @brief  Command completed callbacks.
  * @param  hospi: OSPI handle
  * @retval None
  */
void HAL_OSPI_CmdCpltCallback(OSPI_HandleTypeDef *hospi)
{
  CmdCplt++;
}

/**
  * @brief  Tx Transfer completed callbacks.
  * @param  hospi: OSPI handle
  * @retval None
  */
 void HAL_OSPI_TxCpltCallback(OSPI_HandleTypeDef *hospi)
{
  TxCplt++;
}

/**
  * @brief  Status Match callbacks
  * @param  hospi: OSPI handle
  * @retval None
  */
void HAL_OSPI_StatusMatchCallback(OSPI_HandleTypeDef *hospi)
{
  StatusMatch++;
}

/**
  * @brief  Transfer Error callback.
  * @param  hospi: OSPI handle
  * @retval None
  */
void HAL_OSPI_ErrorCallback(OSPI_HandleTypeDef *hospi)
{
  Error_Handler();
}


/* S70KL1281 memory */
/* Size of the HyperRAM */
#define OSPI_HYPERRAM_SIZE          24
#define OSPI_HYPERRAM_INCR_SIZE     256

/* Timing of the HyperRAM */
#define OSPI_HYPERRAM_RW_REC_TIME   3
#define OSPI_HYPERRAM_LATENCY       6

/* End address of the OSPI memory */
#define OSPI_HYPERRAM_END_ADDR      (1 << OSPI_HYPERRAM_SIZE)

/* Size of buffers */
#define BUFFERSIZE                  (COUNTOF(aTxBuffer) - 1)
/* Exported macro ------------------------------------------------------------*/
#define COUNTOF(__BUFFER__)         (sizeof(__BUFFER__) / sizeof(*(__BUFFER__)))

#endif